angular.module('starter.services', [])

.factory('Chats', function() {
  // Might use a resource here that returns a JSON array

  // Some fake testing data
  var chats = [{
    id: 0,
    name: '屏障',
    lastText: '屏障屏障召唤师等级：1级',
	content:'为你的英雄套上护盾，吸收115-455（取决于英雄等级）点伤害，持续2秒。',
    face: 'img/Skill/SummonerBarrier.png'
  }, {
    id: 1,
    name: '净化',
    lastText: '召唤师等级：1级',
	content:'移除身上的所有限制效果和召唤师技能的减益效果，并且若在接下来的3秒里再次被施加限制效果时，新效果的持续时间会减少65%。',
    face: 'img/Skill/SummonerBoost.png'
  }, {
    id: 2,
    name: '洞察',
    lastText: '召唤师等级：1级',
	content:'将地图上任意一块区域暴露给你的队伍，持续5秒。',
    face: 'img/Skill/SummonerClairvoyance.png'
  }, {
    id: 3,
    name: '引燃',
    lastText: '召唤师等级：1级',
	content:'引燃是对单体敌方目标施放的持续性伤害技能，在5秒的持续时间里造成70-410（取决于英雄等级）真实伤害，获得目标的视野，并减少目标所受的治疗和回复效果。',
    face: 'img/Skill/SummonerDot.png'
  }, {
    id: 4,
    name: '虚弱',
    lastText: '召唤师等级：1级',
	content:'虚弱目标敌方英雄，降低目标英雄30%的移动速度和攻击速度，以及10护甲与魔法抗性，并且他们所造成的伤害减少40%，持续2.5秒。',
    face: 'img/Skill/SummonerExhaust.png'
  }];

  return {
    all: function() {
      return chats;
    },
    remove: function(chat) {
      chats.splice(chats.indexOf(chat), 1);
    },
    get: function(chatId) {
      for (var i = 0; i < chats.length; i++) {
        if (chats[i].id === parseInt(chatId)) {
          return chats[i];
        }
      }
      return null;
    }
  };
})


.factory('Heros', function() {
  // Might use a resource here that returns a JSON array

  // Some fake testing data
  var heros = [
    {
	   id: 0,
      "bio": "亚托克斯是一位传奇战士，也是一个被称为暗裔的上古种族里仅存的五位战士之一。他优雅镇定地挥舞着巨剑，用令人迷离的剑式在千军万马中穿行。每当敌人倒下，亚托克斯那把如同活物般的巨剑便会啜饮着他们的鲜血，同时增强他的力量，并为他残暴、优雅的杀戮战役提供给养。最早关于亚托克斯的记述来源于尘封历史中的记载。它述说着两大仅留下名字的杰出派系护国军和法术领主的战争。在那时，法术领主取得了一系列压倒性的胜利，他们发誓要肃清敌人，护国军处在灭绝的边缘。",
      "shortname": "Aatrox",
      "name": "暗裔剑魔",
      "type2": "4",
	  "type": "14",
	  "skilltitle_1":"鲜血魔井",
	  "skilltip_1":"当使用消耗血量的技能时，亚托克斯会将生命消耗储存进血池。在受到致命伤害后，亚托克斯从血池中提取鲜血并在短时间内将之作为生命值回复。此外，魔井每储蓄2%的生命值，就会为亚托克斯提供1%攻击速度。",
	  "skillstat_1":"",
	  
	  "skilltitle_2":"黑暗之跃",
	  "skilltip_2":"亚托克斯纵身一跃然后猛击向目标位置，对落点中心的敌人造成70/115/160/205/250(+0.6)物理伤害和持续1秒的击飞效果。",
	  "skillstat_2a":"治疗效果：20/25/30/35/40",
	  "skillstat_2b":"额外伤害：60/95/130/165/200",
	  "skillstat_2c":"",
	  "skillstat_2d":"",
	
	  
	  "skilltitle_3":"血之渴望/血之报偿",
	  "skilltip_3":"关闭时：血之渴望：亚托克斯每第三次攻击会回复20/25/30/35/40(+0.25)生命值，此回复效果在半血以下时提升200%()。<br />开启时：血之报偿：亚托克斯每第三次攻击会造成60/95/130/165/200(+1)额外物理伤害，同时他自身损失生命值。",
	  "skillstat_3a":"治疗效果：20/25/30/35/40",
	  "skillstat_3b":"额外伤害：60/95/130/165/200",
	  "skillstat_3c":"",
	  "skillstat_3d":"",
	  
	  "skilltitle_4":"痛苦利刃",
	  "skilltip_4":" 亚托克斯释放剑气，对命中的敌人造成75/110/145/180/215(+0.6)(+0.6)魔法伤害并减少他们40%移动速度，持续1.75/2/2.25/2.5/2.75秒。",
	  "skillstat_4a":"伤害：75/110/145/180/215",
	  "skillstat_4b":"减速时长：1.75/2/2.25/2.5/2.75",
	  "skillstat_4c":"冷却时间：12/11/10/9/8",
	  "skillstat_4d":"",
	  
	  "skilltitle_5":"浴血屠戮",
	  "skilltip_5":"亚托克斯从敌人身上抽取血液，对附近的敌方英雄造成200/300/400(+1)魔法伤害。每命中一个英雄会使鲜血魔井提升20%的储量，并为亚托克斯提供40/50/60%攻速加成和175攻击距离加成，持续12秒。",
	  "skillstat_5a":"伤害：200/300/400",
	  "skillstat_5b":"攻击速度：40/50/60%",
	  "skillstat_5c":"冷却时间：100/85/70",
	  "skillstat_5d":"",
	},{
		 id: 1,
      "bio": "跟其他游荡在艾欧尼亚南部丛林中的狐狸不同，阿狸总觉得她跟魔法世界有一种说不清道不明的联系，一种不完整的联系。在内心深处，她觉得她难以适应这具生而拥有的肉体，梦想有一天可以变成人类。这个梦想看起来遥不可及，直到有一天人类战场上发生的事情改变了她。那是一副惨烈的景象，战场上横七竖八地躺着或重伤或死去的士兵。她被其中一人吸引了：一个身穿长袍的男人，他的生命正在极速地流逝，身边萦绕着一个渐渐衰灭的魔法盾。阿狸走近了他并感到自己内心深处的一些东西被激发了，以某种她难以理解的方式向这个男人展开。",
      "shortname": "Ahri",
      "name": "九尾妖狐",
      "type2": "3",
	  "type": "23",
	  
	"skilltitle_1":"摄魂夺魄",
	"skilltip_1":"在用技能命中敌人后，阿狸会获得一层摄魂夺魄的充能（一个技能最多可获得3层充能）。在获得9层充能效果之后，阿狸的下一个技能将在命中敌人后对阿狸进行治疗。",
	"skillstat_1":"",

	"skilltitle_2":"欺诈宝珠",
	"skilltip_2":"阿狸放出宝珠，造成40/65/90/115/140(+0.35)魔法伤害，随后将其收回，造成40/65/90/115/140(+0.35)真实伤害。阿狸在宝珠被放出的这段时间里，会获得持续衰减的移动速度加成。",
	"skillstat_2a":"伤害：40/65/90/115/140",
	"skillstat_2b":"法力消耗： 65/70/75/80/85",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"妖异狐火",
	"skilltip_3":"阿狸放出三团狐火，狐火会锁定附近的三名敌人（英雄优先）进行攻击，造成40/65/90/115/140(+0.4)魔法伤害。在命中同一目标时，额外的狐火会造成30%的伤害，最多对同一目标造成伤害。",
	"skillstat_3a":"伤害：40/65/90/115/140",
	"skillstat_3b":"冷却时间：9/8/7/6/5",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"魅惑妖术",
	"skilltip_4":"阿狸献出红唇热吻，对命中的第一个敌人造成60/95/130/165/200(+0.5)魔法伤害并将目标魅惑，让目标意乱情迷地走向阿狸。魅惑效果持续1/1.25/1.5/1.75/2秒。",
	"skillstat_4a":"伤害：60/95/130/165/200",
	"skillstat_4b":"持续时间： 1/1.25/1.5/1.75/2",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"灵魄突袭",
	"skilltip_5":"阿狸像妖魅一般向前冲锋，并向周围的3名敌人（英雄优先）发射元气弹，造成70/110/150(+0.3)魔法伤害。灵魄突袭可以在进入冷却阶段前的10秒内被施放最多3次。",
	"skillstat_5a":"伤害：70/110/150",
	"skillstat_5b":"冷却时间：110/95/80",
	"skillstat_5c":"",
	"skillstat_5d":"",
	},{
		 id: 2,
      "bio": "艾欧尼亚岛上存在一个上古教派，致力于维护均衡。规则与混乱、光明与黑暗——万物必须和谐共存，这就是宇宙的真理。该教派名为均衡教派，维护世界均衡的神圣使命则由三个暗影战士来执行。阿卡丽便是这三名暗影勇士中一员，她肩负着修枝的神圣职责——将威胁瓦洛兰大陆和谐的敌人消灭干净。阿卡丽自小和母亲一起习武，练就一身好武功。母亲的训练严酷无情，她的基本原则是：“我们是在替天行道”。阿卡丽十四岁加入均衡教派，那时她就能空手砍断链条。毋庸置疑，她将继承母亲“暗影之拳”的名号。",
      "shortname": "Akali",
      "name": "暗影之拳",
      "type2": "1",
	  "type": "3",
	  	"skilltitle_1":"忍法！苍绯印",
	"skilltip_1":"苍翠之印：阿卡丽的普通攻击能够造成6%额外魔法伤害，并且在此之后，每获得6点法术强度，就会增加1%额外魔法伤害。苍翠之印：阿卡丽获得6%法术吸血，并且在此之后，每获得6点攻击力加成，就会增加1%法术吸血。",
	"skillstat_1":"",

	"skilltitle_2":"奥义！绯叶",
	"skilltip_2":"阿卡丽向目标投掷十字镰，造成35/55/75/95/115(+0.4)魔法伤害，并为目标施加一个持续6秒的绯叶印。当阿卡丽对被附加了绯叶印的单位进行近战攻击时，印记会触发并消耗，以造成45/70/95/120/145(+0.4)额外魔法伤害，并回复40能量值。",
	"skillstat_2a":"初始伤害：35/55/75/95/115",
	"skillstat_2b":"触发伤害：45/70/95/120/145",
	"skillstat_2c":"冷却时间：6/5.5/5/4.5/4",
	"skillstat_2d":"",

	"skilltitle_3":"奥义！霞阵",
	"skilltip_3":"阿卡丽扔下一枚烟幕弹，烟幕将持续8秒。当阿卡丽处于烟幕弹的作用范围内的时候，她会进入隐形状态，并获得20/40/60/80/100%的爆发性移动速度加成，这个加成会在1秒里持续衰减。攻击或施法将使阿卡丽短暂地现身。被烟幕所笼罩的敌人，移动速度将会被减少14/18/22/26/30%。",
	"skillstat_3a":"移动速度加成：20/40/60/80/100%",
	"skillstat_3b":"减速幅度：14/18/22/26/30%",
	"skillstat_3c":"能量消耗：80/75/70/65/60",
	"skillstat_3d":"",

	"skilltitle_4":"奥义！散华",
	"skilltip_4":"阿卡丽舞动十字镰，对附近单位造成30/55/80/105/130(+0.6)(+0.4)物理伤害。",
	"skillstat_4a":"基础伤害：30/55/80/105/130",
	"skillstat_4b":"冷却时间：5/4/3/2/1",
	"skillstat_4c":"能量消耗：60/55/50/45/40",
	"skillstat_4d":"",

	"skilltitle_5":"秘奥义！幻樱杀缭乱",
	"skilltip_5":"阿卡丽穿过阴影对目标发动快速攻击，造成100/175/250(+0.5)魔法伤害。阿卡丽每30,22.5,15秒获得一个幻樱之华，最多储存3个。",
	"skillstat_5a":"伤害：100/175/250",
	"skillstat_5b":"冷却时间：2/1.5/1",
	"skillstat_5c":"",
	"skillstat_5d":"",
	},{
		 id: 3,
      "bio": "作为宏伟屏障牛头族历史上最强大的勇士，阿利斯塔保护着他的部落免受来自瓦洛兰大陆的伤害，但诺克萨斯军队的出现打破了这个局面。达克威尔男爵最年轻的儿子，也是诺克萨斯远征军的指挥官——恺朗达克威尔用诡计将阿利斯塔引诱出村庄。当阿利斯塔回去时，他发现村庄已被烧毁，家人也被杀。他愤怒地咆哮着，冲向一群诺克萨斯精英，将他们大卸八块。一些诺克萨斯的精英召唤师挡住了阿利斯塔的进攻。阿利斯塔被囚禁在诺克萨斯，在此期间，他成为了“绞肉大赛”的角斗士，陷入了无尽的战斗，只为了供诺克萨斯贵族娱乐。",
      "shortname": "Alistar",
      "name": "牛头酋长",
      "type2": "2",
	  "type": "46",
	  	"skilltitle_1":"践踏",
	"skilltip_1":"每当阿利斯塔施放技能时，都会践踏周围单位和防御塔数秒，对他经过的单位造成伤害。",
	"skillstat_1":"",

	"skilltitle_2":"大地粉碎",
	"skilltip_2":"阿利斯塔锤击地面，对附近的的敌人造成60/105/150/195/240(+0.5)魔法伤害并将其震至空中，使其晕眩1.5秒。",
	"skillstat_2a":"伤害：60/105/150/195/240",
	"skillstat_2b":"冷却时间：17/16/15/14/13",
	"skillstat_2c":"法力消耗：65/70/75/80/85",
	"skillstat_2d":"",

	"skilltitle_3":"野蛮冲撞",
	"skilltip_3":"阿利斯塔顶向一名敌人，造成55/110/165/220/275(+0.7)魔法伤害，并击退目标。",
	"skillstat_3a":"伤害：55/110/165/220/275",
	"skillstat_3b":"冷却时间：14/13/12/11/10",
	"skillstat_3c":"法力消耗：65/70/75/80/85",
	"skillstat_3d":"",

	"skilltitle_4":"胜利怒吼",
	"skilltip_4":"回复自己60/90/120/150/180(+0.2)生命值，并回复附近友军的生命值，但回复效果只有前者的35%。附近每有一个敌方单位阵亡，这个技能的冷却时间就会减少2秒。",
	"skillstat_4a":"法力消耗：50/60/70/80/90",
	"skillstat_4b":"生命回复：60/90/120/150/180",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"坚定意志",
	"skilltip_5":"阿利斯塔增加60/75/90物理攻击，移除身上所有的控制效果，受到的物理和魔法伤害减少50/60/70%，持续7秒。",
	"skillstat_5a":"攻击力：60/75/90",
	"skillstat_5b":"冷却时间：120/100/80",
	"skillstat_5c":"",
	"skillstat_5d":"",
	},{
		 id: 4,
      "bio": "''与世隔绝比死亡还要孤独。''如恕瑞玛的孤魂一般，孤独伤心的阿木木一直在世界各地游荡，找寻着他的朋友。但是由于被远古魔法所诅咒，他的触碰带着死亡与毁灭，因此他注定永远孤独。从声称见过他的人的描述来看，阿木木是一个身材矮小的活尸，浑身缠着青苔色的绷带。很多传说和神话都由他而起，但经过了千百年的传唱之后，也不知道哪些部分是虚构，哪些部分是真实的了。",
      "shortname": "Amumu",
      "name": "殇之木乃伊",
      "type2": "2",
	  "type": "46",
	  	"skilltitle_1":"诅咒之触",
	"skilltip_1":"阿木木的攻击在短时间内减少目标的魔法抗性。",
	"skillstat_1":"",

	"skilltitle_2":"绷带牵引",
	"skilltip_2":"向目标区域投掷粘稠的绷带，若击中敌人会将阿木木自己拉向目标，晕眩他们，造成80/130/180/230/280(+0.7)魔法伤害。",
	"skillstat_2a":"伤害：80/130/180/230/280",
	"skillstat_2b":"冷却时间：16/14/12/10/8",
	"skillstat_2c":"法力消耗：80/90/100/110/120",
	"skillstat_2d":"",

	"skilltitle_3":"绝望光环",
	"skilltip_3":"激活：附近的敌人每秒将受到8/12/16/20/24魔法伤害，并且每秒损失他们1/1.5/2/2.5/3(+0.01)%的最大生命值。",
	"skillstat_3a":"百分比伤害：1/1.5/2/2.5/3%",
	"skillstat_3b":"基础伤害：8/12/16/20/24",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"阿木木的愤怒",
	"skilltip_4":"被动：减少阿木木受到的物理伤害:2/4/6/8/10。主动：阿木木对周围的单位造成75/100/125/150/175(+0.5)魔法伤害。每次阿木木被攻击，该技能的冷却时间减少0.5秒。",
	"skillstat_4a":"伤害减少：2/4/6/8/10",
	"skillstat_4b":"冷却时间：10/9/8/7/6",
	"skillstat_4c":"伤害：75/100/125/150/175",
	"skillstat_4d":"",

	"skilltitle_5":"木乃伊之咒",
	"skilltip_5":"阿木木用绷带将周围敌方单位通通缠住，造成150/250/350(+0.8)魔法伤害，并导致他们无法攻击或移动2秒。",
	"skillstat_5a":"伤害：150/250/350",
	"skillstat_5b":"法力消耗：100/150/200",
	"skillstat_5c":"冷却时间：150/130/110",
	"skillstat_5d":"",
	},{
		 id: 5,
      "bio": "艾尼维亚是至寒凛冬里的生物，是寒冰魔法的神秘化身，也是弗雷尔卓德的上古守护者。她指引着这块土地上的所有能量与愤怒，召唤冰雪和寒风用以对付那些伤害她家园的人。她是一个善良而神秘的生物，无论生存，死亡还是重生，艾尼维亚不眠不休，保护弗雷尔卓德是她永恒的使命。艾尼维亚的存在就和弗雷尔卓德无尽的冰霜一样久远。早在人类踏足这片永冻之土前，她便在此经历了无数次的生命与死亡。她永恒循环的开始和结束总是预示着巨大的改变，从怒吼风暴的平息到冰河世纪的兴衰。",
      "shortname": "Anivia",
      "name": "冰晶凤凰",
      "type2": "2",
	  "type": "26",
	  	"skilltitle_1":"寒霜涅槃",
	"skilltip_1":"在濒临死亡的时候，艾尼维亚将会变成一枚凤凰蛋。如果凤凰蛋在6秒内没有被击破的话，艾尼维亚就会闪亮重生。",
	"skillstat_1":"",

	"skilltitle_2":"寒冰闪耀",
	"skilltip_2":"一枚巨大的冰块飞向目标区域，对沿途的敌人们造成60/85/110/135/160(+0.4)魔法伤害并冰冻目标，使他们的移动速度减少%。在飞到范围的终点时，或艾尼维亚再次施放此技能时，冰块会爆炸，对小范围内的敌人造成60/85/110/135/160(+0.4)魔法伤害，并晕眩这些单位1.1/1.2/1.3/1.4/1.5秒。",
	"skillstat_2a":"伤害：60/85/110/135/160",
	"skillstat_2b":"晕眩时长：1.1/1.2/1.3/1.4/1.5",
	"skillstat_2c":"冷却时间：12/11/10/9/8",
	"skillstat_2d":"法力消耗： 80/90/100/110/120",

	"skilltitle_3":"寒冰屏障",
	"skilltip_3":"艾尼维亚召唤出一道宽400/500/600/700/800单位长度的无法通过的冰墙，来阻挡所有人的移动。冰墙会在融化前持续5秒。",
	"skillstat_3a":"宽度：400/500/600/700/800",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"霜寒刺骨",
	"skilltip_4":"艾尼维亚用刺骨寒风轰击敌人，造成50/75/100/125/150(+0.5)魔法伤害。被【寒冰闪耀】或【冰川风暴】所减速的目标会受到双倍伤害。",
	"skillstat_4a":"伤害：50/75/100/125/150",
	"skillstat_4b":"消耗法力：50/60/70/80/90",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"冰川风暴",
	"skilltip_5":"激活：艾尼维亚在目标区域召唤出一阵夹杂着冰与雹的强雨，其范围会在3秒里持续扩大，对范围内的敌人造成每秒80/120/160(+0.25)魔法伤害并冰冻目标，减缓目标20/30/40%的移动速度和攻击速度。伤害、减速和冰冻效果会在范围扩至上限时提升50%。每秒消耗40/50/60法力。",
	"skillstat_5a":"每秒伤害：80/120/160",
	"skillstat_5b":"减速效果：40/50/60",
	"skillstat_5c":"每秒法力消耗：null",
	"skillstat_5d":"",
	},{
		 id: 6,
      "bio": "诺克萨斯里总会有人不同意诺克萨斯最高指挥部的所作所为。诺克萨斯最高指挥部刚镇压了自称王储的瑞斯卡里奥发动的政变。他们正准备镇压任何对新政府有异议的行动或组织。这群称作灰色秩序的政治与社会的放逐者，试图安静地离开他们的邻居，因为他们追求的是黑暗的秘术知识。这个组织的领导者是一对夫妻：神秘术士格雷戈里·哈斯塔和他的妻子暗影巫女阿莫琳。他们从瓦洛兰大陆带走了一批魔法师和其他知识分子。他们越过宏伟屏障，在禁忌的巫毒之地北部重新安家。",
      "shortname": "Annie",
      "name": "黑暗之女",
      "type2": "2",
	  "type": "2",
	  	"skilltitle_1":"嗜火",
	"skilltip_1":"在施放4个技能后，安妮的下一次伤害类技能就会对目标造成短暂的晕眩效果。",
	"skillstat_1":"",

	"skilltitle_2":"碎裂之火",
	"skilltip_2":"造成80/115/150/185/220(+0.8)魔法伤害。如果目标死于碎裂之火，则返还法力值并且冷却时间减半。",
	"skillstat_2a":"伤害：80/115/150/185/220",
	"skillstat_2b":"消耗法力：60/65/70/75/80",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"焚烧",
	"skilltip_3":"向锥形区域施放一道烈焰，对区域内的所有敌人造成70/115/160/205/250(+0.85)魔法伤害。",
	"skillstat_3a":"伤害：70/115/160/205/250",
	"skillstat_3b":"消耗法力： 70/80/90/100/110",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"熔岩护盾",
	"skilltip_4":"安妮为她自己和提伯斯提供16/22/28/34/40%伤害减免，持续3秒。当护盾处于激活状态时，敌人对护盾进行普攻会受到20/30/40/50/60(+0.2)魔法伤害。",
	"skillstat_4a":"伤害减免：16/22/28/34/40%",
	"skillstat_4b":"伤害回敬：20/30/40/50/60",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"提伯斯之怒",
	"skilltip_5":"召唤提伯斯，对目标范围内的敌人造成150/275/400(+0.65)魔法伤害。在接下来的45秒里，提伯斯会灼烧附近的敌人，每秒造成10/15/20(+0.1)魔法伤害，并且它的普攻会造成50/75/100(+)魔法伤害。安妮可以通过按住ALT键不放，然后点击鼠标右键的方式，或者重新激活此技能的方式来控制提伯斯。在下列情况中，提伯斯会变得暴怒：刚被召唤出；安妮对敌方英雄使用了带【嗜火】的技能时；安妮死亡时。暴怒：提伯斯获得275%攻速加成和100%移速加成，这些加成会在3秒里持续衰减。",
	"skillstat_5a":"伤害：150/275/400",
	"skillstat_5b":"提伯斯生命值：1200/2100/3000 提伯斯护甲和魔法抗性：30/50/70 提伯斯攻击力：50/75/100 提伯斯燃烧伤害：10/15/20",
	"skillstat_5c":"冷却时间：120/100/80",
	"skillstat_5d":"",
	 },{
		 id: 7,
      "bio": "伴随着每一发弓箭从她的上古寒冰弓上发射，艾希证明了她是一位神射手。她小心的选择每一个目标，等待正确的时机，射出精准有力的箭矢。她抱着同样的愿景和专注于她的目标，为了寻求弗雷尔卓德部族的统一并将他们打造成一个强大的国家。还是孩子的时候，艾希便是一个梦想家。她对祖先们巨大且被废弃的城堡感到惊讶，她会花许多时间在篝火旁聆听弗雷尔卓德虚构的英雄故事。她最喜欢阿瓦罗萨的传说，声名显赫的女王曾经创下统一弗雷尔卓德的壮举。尽管母亲会责备她愚笨，艾希却发誓终有一天她会加入冰原上分裂而好战的部族。",
      "shortname": "Ashe",
      "name": "寒冰射手",
      "type2": "2",
	  "type": "56",
	  	"skilltitle_1":"冰霜射击",
	"skilltip_1":"艾希的攻击会让目标减速，并使艾希对这些目标造成更高伤害。艾希的暴击不会造成额外伤害，但会对目标施加一个强化版减速效果。",
	"skillstat_1":"",

	"skilltitle_2":"射手的专注",
	"skilltip_2":"被动：普攻在命中时会提供【全神贯注】效果，持续4秒，最多可叠加4层。每过一段时间会衰减一层效果，并且在效果到达4层时，就可以施放【射手的专注】并消耗掉所有【全神贯注】。主动：在4秒里，艾希获得20/25/30/35/40%攻击速度，并且她的普攻会发射一阵箭风，造成物理伤害。在主动效果的持续期间里，艾希不会叠加【全神贯注】。【射手的专注】会施加【冰霜射击】效果。",
	"skillstat_2a":"攻击速度加成：20/25/30/35/40%",
	"skillstat_2b":"飓风箭阵的攻击力收益系数：1.05/1.1/1.15/1.2/1.25",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"万箭齐发",
	"skilltip_3":"向前方的锥形范围射出箭矢，每支箭造成20/35/50/65/80(+1)物理伤害。敌方单位可以一次性格挡多支箭矢，但只会受到一次伤害。由于【冰霜射击】的存在，【万箭齐发】在命中敌方英雄时会视为暴击。",
	"skillstat_3a":"基础伤害：20/35/50/65/80",
	"skillstat_3b":"冷却时间：15/12.5/10/7.5/5",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"鹰击长空",
	"skilltip_4":"艾希朝目标地点放出一只猎鹰之灵，猎鹰之灵会在飞行时提供沿途的视野，视野会存留5秒。艾希可储存2发猎鹰之灵的充能。",
	"skillstat_4a":"充能时间：",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"魔法水晶箭",
	"skilltip_5":"艾希射出魔法水晶箭，在命中第一个敌方英雄时造成200/400/600(+1)魔法伤害并晕眩此目标，晕眩时长取决于飞行距离，最多3.5秒。目标周围的敌人会受到一半伤害。",
	"skillstat_5a":"伤害：200/400/600",
	"skillstat_5b":"冷却时间：100/90/80",
	"skillstat_5c":"",
	"skillstat_5d":"",
	},{
		 id: 8,
      "bio": "源头之初的巨响，萦绕于奥瑞利安·索尔的降临。召唤师峡谷迎来了一位中距离的法师英雄。他任意操纵着星辰流变的轨迹，降下湮灭一切的力量。而当他有了更妙的去处时，便会升空翱翔，穿越地形，让酝酿多时的毁灭泽及天下。",
      "shortname": "AurelionSol",
      "name": "铸星龙王",
      "type2": "2",
	  "type": "3",
	  	"skilltitle_1":"星原之准",
	"skilltip_1":"行星围绕着奥瑞利安·索尔，并对被它们命中的敌人造成魔法伤害。",
	"skillstat_1":"",

	"skilltitle_2":"星河急涌",
	"skilltip_2":"第一段施放：奥瑞利安·索尔创造一个新的星核，星核会随着时间成长，并为奥瑞利安·索尔提供10%移动速度加成。星核将在到达奥瑞利安·索尔的外轨时爆炸，同时施加70/110/150/190/230(+0.65)魔法伤害和持续1.1/1.2/1.3/1.4/1.5秒的晕眩效果。第二段施放：提前引爆星核。",
	"skillstat_2a":"伤害：70/110/150/190/230",
	"skillstat_2b":"晕眩时长：1.1/1.2/1.3/1.4/1.5",
	"skillstat_2c":"法力消耗：60/70/80/90/100",
	"skillstat_2d":"",

	"skilltitle_3":"星穹暴涨",
	"skilltip_3":"被动：将护体行星的基础伤害提升5/10/15/20/25。激活：奥瑞利安·索尔将护体行星推入外轨并造成150%伤害，总共造成(+)魔法伤害。",
	"skillstat_3a":"被动伤害加成：5/10/15/20/25",
	"skillstat_3b":"每秒法力消耗：22/24/26/28/30",
	"skillstat_3c":"冷却时间：6/5.5/5/4.5/4",
	"skillstat_3d":"",

	"skilltitle_4":"星流横溢",
	"skilltip_4":"被动：连续朝着一个方向移动，会获得不断提升的移动速度加成，最多可获得25/30/35/40/45%移动速度加成。主动：朝着选定方向飞行3000/4000/5000/6000/7000码。只能在非战斗状态下施放。在飞行时，奥瑞利安·索尔既能看见隔墙的单位，也能被隔墙的单位看见。承受来自英雄或防御塔的伤害时会被强行着陆。",
	"skillstat_4a":"移速加成上限：25/30/35/40/45%",
	"skillstat_4b":"飞行距离：3000/4000/5000/6000/7000",
	"skillstat_4c":"冷却时间：60/55/50/45/40",
	"skillstat_4d":"",

	"skilltitle_5":"星弦高落",
	"skilltip_5":"喷吐出一道纯净的星火，造成150/250/350(+0.7)魔法伤害以及40/50/60%减速效果，持续2秒。星火还会将附近的敌人击退至奥瑞利安·索尔的外轨。",
	"skillstat_5a":"伤害：150/250/350",
	"skillstat_5b":"减速效果：40/50/60%",
	"skillstat_5c":"冷却时间：120/100/80",
	"skillstat_5d":"",
	},{
		 id: 9,
      "bio": "“恕瑞玛曾是符文之地的荣耀。我将复兴其荣光。”阿兹尔是上古时期恕瑞玛的一位凡人皇帝，一位站在不朽神化焦点的自豪之人。但他的狂妄导致了他被背叛，在他最伟大胜利的那一刻被谋杀。而在数千年后的今天，他重获新生并成为了力量无边的飞升者。阿兹尔的城市已经从黄沙之下崛起，他要让恕瑞玛恢复曾经的荣光。",
      "shortname": "Azir",
      "name": "沙漠皇帝",
      "type2": "2",
	  "type": "25",
	  	"skilltitle_1":"恕瑞玛的传承",
	"skilltip_1":"阿兹尔可以从友方或敌方防御塔的废墟中召唤太阳圆盘。",
	"skillstat_1":"",

	"skilltitle_2":"狂沙猛攻",
	"skilltip_2":"阿兹尔把所有黄沙士兵派往一个地点。黄沙士兵会对沿途的所有敌人造成65/85/105/125/145(+0.5)魔法伤害和一层25%减速效果。这个减速效果持续1秒，并且可以叠加。被多个黄沙士兵击中的敌人不会受到额外伤害。",
	"skillstat_2a":"伤害：65/85/105/125/145",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"沙兵现身",
	"skilltip_3":"被动：获得20/30/40/50/60%攻击速度。主动：阿兹尔召唤出一个持续9秒的黄沙士兵。在阿兹尔对一名敌人进行普攻时，如果该名敌人在某个黄沙士兵的攻击范围内，那么这名黄沙士兵会代替阿兹尔进行攻击，对一条直线上的敌人造成(+0.6)魔法伤害。如果有多个士兵对相同目标进行攻击，那么除第一个士兵外的其它士兵只造成25%伤害。阿兹尔最多可储存个黄沙士兵。每过秒，就有一个黄沙士兵整装待发。黄沙士兵可以攻击阿兹尔普攻距离之外的敌人。在距离阿兹尔过远时，黄沙士兵就会消散。在敌方防御塔附近时，黄沙士兵的消散速度会翻倍。",
	"skillstat_3a":"攻击速度：20/30/40/50/60%",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"阿兹尔突进到他的一个黄沙士兵身旁，对命中的敌人造成60/90/120/150/180(+0.4)魔法伤害。如果阿兹尔命中了一名敌方英雄，那么他的突进会停止并获得持续4秒的护盾，护盾可以吸收最多80/120/160/200/240(+)[15%额外生命值]伤害。",
	"skilltip_4":"伤害：60/90/120/150/180",
	"skillstat_4a":"护盾：80/120/160/200/240",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"禁军之墙",
	"skilltip_5":"阿兹尔召唤一道由禁军组成的人墙向前冲锋，击退沿途的敌人并造成150/225/300(+0.6)魔法伤害。然后这道由禁军组成的人墙会持续3秒。敌方英雄将会被禁军之墙所阻挡，并且无法用突进技能穿过这道人墙，但阿兹尔和他的友军可以自由穿过这道人墙。禁军之墙不会与阿兹尔的攻击或技能产生交互。",
	"skillstat_5a":"伤害：150/225/300",
	"skillstat_5b":"士兵数量：4/5/6",
	"skillstat_5c":"冷却时间：140/120/100",
	"skillstat_5d":"",
	 },{
		 id: 10,
      "bio": "巴德游历于各个超乎凡间生命体想象的秘界之间。瓦洛兰最出色的一些学者已经付出他们的一生去尝试理解巴德所体现的奥秘。这个充满谜团的灵体在瓦洛兰的历史中有过很多名字，但星界游荡者和伟大看护者这样的头衔对他的真正意图来说只是管中窥豹而已。当不可知的宇宙构造受到威胁时，巴德就会引导所有存在的事物避过彻底灭绝的命运。",
      "shortname": "Bard",
      "name": "星界游神",
      "type2": "2",
	  "type": "26",
	  	"skilltitle_1":"旅者的召唤",
	"skilltip_1":"巴德的存在会导致神奇的调和之音出现，这些调和之音会为巴德提供经验值，法力和移动速度加成。此外，小型灵体会跟随巴德并协助他进行攻击——收集调和之音会让这些木灵们随着游戏进程不断地获取能量。",
	"skillstat_1":"",

	"skilltitle_2":"星界束缚",
	"skilltip_2":"巴德发射一束能量弹，对1或2名敌人造成80/125/170/215/260(+0.65)魔法伤害。被命中的第一个目标会被减速60%，持续1/1.2/1.4/1.6/1.8秒。如果能量弹命中了另一个敌人或墙体，则被命中的敌人都会被晕眩1/1.2/1.4/1.6/1.8秒。",
	"skillstat_2a":"伤害：80/125/170/215/260",
	"skillstat_2b":"减速时长：1/1.2/1.4/1.6/1.8",
	"skillstat_2c":"晕眩时长：1/1.2/1.4/1.6/1.8",
	"skillstat_2d":"冷却时间：11/10/9/8/7",

	"skilltitle_3":"游神圣坛",
	"skilltip_3":"巴德升起一座治疗圣坛，圣坛会为前来拜访的友军回复30/60/90/120/150(+0.3)到70/110/150/190/230(+0.6)生命（在圣坛出现10秒时达到最大值）。圣坛还会为受影响的英雄提供50%的移动速度加成，这个加成会在1.5秒里持续衰减。巴德最多可同时拥有3座圣坛，圣坛会持续到被一名友方英雄拜访或被一名敌方英雄摧毁为止。处于激活状态的圣坛数：/",
	"skillstat_3a":"基础治疗：30/60/90/120/150",
	"skillstat_3b":"最大治疗：70/110/150/190/230",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"神奇旅程",
	"skilltip_4":"巴德在附近的地形上开启一道单向传送带。友军和敌人都可以在靠近入口时通过右键点击来使用传送带，但友军的传送速度比敌人快10/20/30/40/50%。传送带会在10秒后消失。",
	"skillstat_4a":"冷却时间：18/17/16/15/14",
	"skillstat_4b":"友方移动速度加成：10/20/30/40/50%",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"调和命运",
	"skilltip_5":"巴德朝目标区域发出一道魔法能量弧光。在弧光着陆后，目标区域内的所有英雄、小兵、野怪、防御塔都会进入凝滞状态，变得免疫伤害、无法被选取并且无法进行任何动作，持续2.5秒。就连史诗级野怪也会进入凝滞状态，尽管它们免疫控制效果。",
	"skillstat_5a":"冷却时间：130/115/90",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 11,
      "bio": "祖安是个被魔法和科学双重扭曲的城市，并且它无节制的实验天性已自酿恶果。然而，祖安的宽松限制，让它的研究者和发明家们有很大余地，得以用一种逐步增加的速率去推动科学的界限，尽管是好是坏另说。在这种条件下，来自祖安科技魔法大学的一群博士生在智能蒸汽自动化领域有所创新，他们发明了蒸汽机器人布里茨。布里茨被开发出来的目的，是协助祖安的有害废料回收处理工作，在各种不允许人工监控的条件下快速判断废料是否可回收。然而，布里茨很快就开始展现出了不同寻常的行为。",
      "shortname": "Blitzcrank",
      "name": "蒸汽机器人",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"法力屏障",
	"skilltip_1":"布里茨生命值低于20%时，将激活法力屏障，产生相当于布里茨法力值50%的法力护盾，持续10秒。法力屏障每90秒仅能触发一次。",
	"skillstat_1":"",

	"skilltitle_2":"机械飞爪",
	"skilltip_2":"布里茨将他的右手发射出去。若右手命中了一名敌方单位，则会眩晕该单位并将其抓到面前，同时造成80/135/190/245/300(+1)魔法伤害。",
	"skillstat_2a":"伤害：80/135/190/245/300",
	"skillstat_2b":"冷却时间：20/19/18/17/16",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"过载运转",
	"skilltip_3":"布里茨进行超级充能，移动速度提升70/75/80/85/90%，攻击速度提升30/38/46/54/62%，持续5秒。移动速度加成会随时间不断衰减。当【W过载运转】结束后，布里茨的移动速度会减少30%，持续1.5秒。",
	"skillstat_3a":"移动速度：70/75/80/85/90%",
	"skillstat_3b":"攻击速度：30/38/46/54/62%",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"能量铁拳",
	"skilltip_4":"布里茨为机械手臂充能，下一次攻击造成双倍伤害并将目标抛向空中。",
	"skillstat_4a":"冷却时间：9/8/7/6/5",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"静电力场",
	"skilltip_5":"被动效果：布里茨每2.5秒会释放一道电弧，对附近的随机一个单位造成100/200/300(+0.2)魔法伤害。主动效果：造成250/375/500(+1)魔法伤害且沉默周围敌方单位，持续0.5秒。移除被动魔法攻击直到技能冷却时间结束。",
	"skillstat_5a":"闪电伤害：100/200/300",
	"skillstat_5b":"主动激活伤害：250/375/500",
	"skillstat_5c":"冷却时间：60/40/20",
	"skillstat_5d":"",
	 },{
		 id: 12,
      "bio": "在遥远的洛克法，有个叫基根丶诺和的海上掠夺者。和洛克法的其他人一样，基根和他的船员到处航行，掠夺那些倒霉蛋的财物。对某些人而言，他掠夺财物，是个魔头。但对另外一些人而言，他和大众一样只是个平凡的强盗。某个夜晚，他们正驶过北冰洋时，发现冰冻废土上闪动着奇光。这些奇光似乎有种催眠效果，将他们吸引到身边，船员们如同飞蛾扑火般涌上来。经过艰难地跋涉后，他们来到了被古代符文覆盖着的窑洞。由于符文非常古老，他们无从解读。在基根的带领下，他们走进窑洞。在那里，他们发现一个完美的冰笼，冰笼里有一团跳动着的火焰。",
      "shortname": "Brand",
      "name": "复仇焰魂",
      "type2": "2",
	  "type": "2",
	  	"skilltitle_1":"炽热之焰",
	"skilltip_1":"布兰德的技能会对他的目标施加【烈焰焚身】效果，在4秒里持续造成共2%目标最大生命值的魔法伤害，最多可叠加3次。当【炽热之焰】在一名英雄或大型野怪身上叠至满层时，它会变得不稳定。它会在2秒内爆炸，在目标附近的区域造成大量伤害。",
	"skillstat_1":"",

	"skilltitle_2":"火焰烙印",
	"skilltip_2":"布兰德向前方放出一团火球，可造成80/110/140/170/200(+0.55)魔法伤害。炽热之焰: 如果目标带有【烈焰焚身】效果，【火焰烙印】将使目标晕眩1.5秒。",
	"skillstat_2a":"伤害：80/110/140/170/200",
	"skillstat_2b":"冷却时间：8/7.5/7/6.5/6",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"烈焰之柱",
	"skilltip_3":"在短暂的延迟后，布兰德会在目标区域创造一根烈焰之柱。造成75/120/165/210/255(+0.6)魔法伤害对范围内的敌方单位。炽热之焰:【W烈焰之柱】会对带有【烈焰焚身】效果的单位额外造成25%伤害。",
	"skillstat_3a":"伤害：75/120/165/210/255",
	"skillstat_3b":"冷却时间：10/9.5/9/8.5/8",
	"skillstat_3c":"法力消耗：60/70/80/90/100",
	"skillstat_3d":"",

	"skilltitle_4":"烈火燃烧",
	"skilltip_4":"布兰德在目标身上引发一阵强力的爆裂，造成70/90/110/130/150(+0.35)魔法伤害。炽热之焰:如果目标带有【烈焰焚身】效果，那么此技能会扩散至目标附近的敌人。",
	"skillstat_4a":"伤害：70/90/110/130/150",
	"skillstat_4b":"冷却时间：10/9/8/7/6",
	"skillstat_4c":"法力消耗：70/75/80/85/90",
	"skillstat_4d":"",

	"skilltitle_5":"烈焰风暴",
	"skilltip_5":"布兰德释放一颗破坏力极强的火焰之种，每次弹跳造成100/200/300(+0.25)魔法伤害，最多可弹跳5次。弹跳会优先以带有即将满层的【炽热之焰】效果的英雄为目标。炽热之焰: 如果目标带有【烈焰焚身】效果，烈焰风暴将暂时使目标减速30/45/60%。",
	"skillstat_5a":"每次弹跳的伤害：100/200/300",
	"skillstat_5b":"减速幅度：30/45/60%",
	"skillstat_5c":"冷却时间：105/90/75",
	"skillstat_5d":"",
	 },{
		 id: 13,
      "bio": "“想听个睡前故事吗？” “奶奶，我已经过了听故事的年龄了！”“听故事可没有年龄的限制。”小女孩嫌恶地爬到床上等着，因为她知道这场仗她赢不了。刺骨的寒风在屋外嗥叫着，将纷飞的雪花抽打成魔鬼般的旋涡。“要听哪一种？想听冰霜女巫的故事么？” “不要，不听她的故事。” “那要听段布隆的故事么！”小女孩沉默以对。老妇人微笑地说，“噢，那可就多了。",
      "shortname": "Braum",
      "name": "弗雷尔卓德之心",
      "type2": "2",
	  "type": "46",
	  	"skilltitle_1":"震荡猛击",
	"skilltip_1":"布隆可以通过普攻和【寒冬之咬】来增加【震荡猛击】的叠加层数。他和他的友军可以通过普攻来不断地增加【震荡猛击】的叠加层数，当目标身上的【震荡猛击】层数到达4时，就会被击晕。",
	"skillstat_1":"",

	"skilltitle_2":"寒冬之咬",
	"skilltip_2":"布隆驱动盾牌里的冷冻冰块，对命中的第一个敌人造成60/105/150/195/240(+)[最大生命值的2.5%]魔法伤害，并将目标减速70%，这个减速效果会在接下来的2秒里持续衰减。此外，还会对目标施加一层震荡猛击效果。",
	"skillstat_2a":"伤害：60/105/150/195/240",
	"skillstat_2b":"冷却时间：10/9/8/7/6",
	"skillstat_2c":"法力消耗：55/60/65/70/75",
	"skillstat_2d":"",

	"skilltitle_3":"挺身而出",
	"skilltip_3":"布隆跃向目标友方英雄或小兵。在抵达时，布隆和友方英雄会获得0点护甲和0点魔法抗性（15/17.5/20/22.5/25加上布隆10/11.5/13/14.5/16%的额外护甲/魔法抗性），持续3秒。",
	"skillstat_3a":"基础护甲和魔抗：15/17.5/20/22.5/25",
	"skillstat_3b":"防御收益：10/11.5/13/14.5/16%",
	"skillstat_3c":"冷却时间：14/13/12/11/10",
	"skillstat_3d":"法力消耗：50/55/60/65/70",

	"skilltitle_4":"坚不可摧",
	"skilltip_4":"布隆减少即将到来的伤害，并为他身后的友军格挡伤害。布隆朝一个方向举起盾牌，持续3/3.25/3.5/3.75/4秒，并使来自目标方向的第一次攻击或技能变得无效，减少后续攻击或技能30/32.5/35/37.5/40%的伤害。布隆还将拦截敌方的飞行道具，并将它们摧毁，但自身要承受它们的伤害。在举盾期间，布隆获得10%移动速度加成。",
	"skillstat_4a":"持续时长：3/3.25/3.5/3.75/4",
	"skillstat_4b":"伤害减免：30/32.5/35/37.5/40%",
	"skillstat_4c":"冷却时间：18/16/14/12/10",
	"skillstat_4d":"法力消耗：30/35/40/45/50",

	"skilltitle_5":"冰川裂隙",
	"skilltip_5":"布隆敲击地面，击飞他身边和前方一条直线上的所有敌人。此外，还会在前方的直线上留下一条持续3秒裂隙，裂隙能让位于其上的敌人减速40/50/60%。被命中的敌人会受到150/250/350(+0.6)魔法伤害。被命中的第一个敌方英雄会被击飞1/1.25/1.5秒，而后续的敌人会被短暂击飞。",
	"skillstat_5a":"伤害：150/250/350",
	"skillstat_5b":"击飞时长：1/1.25/1.5",
	"skillstat_5c":"减速幅度：40/50/60%",
	"skillstat_5d":"冷却时间：140/120/100",
	 },{
		 id: 14,
      "bio": "“向前跑吧。我会让你先跑5分钟。”皮尔特沃夫（皮城）被认为“进步之城”的主要原因是其极低的犯罪率。然而，皮尔特沃夫的低犯罪率也不是一来就有的。最初，皮尔特沃夫为了发展高科技，进口了很多珍贵资源，强盗和小偷们发现这块肥肉后便经常光顾这里。传说中的皮城女警凯特琳就此诞生，如果没有她，这里将成为犯罪集团的乐土。凯特琳的父亲是一名富有的政治家，母亲则是海克斯科技的先驱研究者，凯特琳在14岁的时候就表现出其侦查追踪的天赋。",
      "shortname": "Caitlyn",
      "name": "皮城女警",
      "type2": "2",
	  "type": "5",
	  	"skilltitle_1":"爆头",
	"skilltip_1":"每进行几次基础攻击，对中了她的陷阱或绳网的单位进行攻击时，凯特琳就会造成一次【爆头】效果，造成随暴击几率增长的额外伤害。在对中了陷阱或绳网的目标进行攻击时，凯特琳的【爆头】攻击距离翻倍。",
	"skillstat_1":"",

	"skilltitle_2":"和平使者",
	"skilltip_2":"凯特琳加速转动步枪，1秒后射出一颗狭窄的穿刺弹，造成30/70/110/150/190(+)物理伤害。在命中任何单位后，它会绽开为一个更宽的弹体, 但伤害值减少33%。总会对被陷阱暴露的目标造成全额伤害。",
	"skillstat_2a":"伤害：30/70/110/150/190",
	"skillstat_2b":"冷却时间：10/9/8/7/6",
	"skillstat_2c":"法力消耗：50/60/70/80/90",
	"skillstat_2d":"",

	"skilltitle_3":"约德尔诱捕器",
	"skilltip_3":"布置一个陷阱，陷阱可以束缚敌方英雄2秒并将目标暴露在己方视野内。陷阱可以持续90秒。最多可以有3/3/4/4/5个陷阱同时存在。【爆头】会对中了陷阱的的敌人额外造成30/70/110/150/190 (+)伤害。",
	"skillstat_3a":"充能时间：",
	"skillstat_3b":"最大陷阱数：3/3/4/4/5",
	"skillstat_3c":"对中陷阱目标的额外爆头伤害：30/70/110/150/190",
	"skillstat_3d":"",

	"skilltitle_4":"90口径绳网",
	"skilltip_4":"凯特琳发射一张绳网，同时自身因后坐力而被击退。绳网造成70/110/150/190/230(+0.8)魔法伤害，并减少命中的首个敌方目标50%的移动速度，持续1秒。",
	"skillstat_4a":"伤害：70/110/150/190/230",
	"skillstat_4b":"冷却时间：16/14.5/13/11.5/10",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"让子弹飞",
	"skilltip_5":"凯特琳花费1秒时间来精心准备完美一击，对2000/2500/3000码范围内的一名敌方英雄造成250/475/700(+2)物理伤害，但其他敌方英雄能为目标英雄拦截子弹。",
	"skillstat_5a":"伤害：250/475/700",
	"skillstat_5b":"范围：2000/2500/3000",
	"skillstat_5c":"冷却时间：90/75/60",
	"skillstat_5d":"",
	 },{
		 id: 15,
      "bio": "卡西奥佩娅是个可怕的生物——人首蛇身——她只需一瞥就能带来死亡。她是诺克萨斯最具影响力的某个家族的小女儿，曾经是个美丽但狡猾的交际花，有能力操纵最最无情的心。在被一个恕瑞玛陵墓守卫的毒液给变形后，她继续一如往昔地为诺克萨斯的利益服务，以一种更加……本能的方式。",
      "shortname": "Cassiopeia",
      "name": "魔蛇之拥",
      "type2": "2",
	  "type": "2",
	  	"skilltitle_1":"优雅蛇行",
	"skilltip_1":"卡西奥佩娅随等级获得移动速度，但她无法购买鞋子类装备。",
	"skillstat_1":"",

	"skilltitle_2":"瘟毒爆炸",
	"skilltip_2":"用瘟毒引爆一片区域内的敌人。如果命中了一名敌方英雄，卡西奥佩娅会获得30/35/40/45/50%移动速度，加速效果会在3秒里持续衰减。瘟毒在3秒里持续造成共75/120/165/210/255(+0.7)魔法伤害。",
	"skillstat_2a":"基础伤害：75/120/165/210/255",
	"skillstat_2b":"移动速度：30/35/40/45/50%",
	"skillstat_2c":"法力消耗：60/65/70/75/80",
	"skillstat_2d":"",

	"skilltitle_3":"剧毒迷雾",
	"skilltip_3":"卡西奥佩娅呈弧度喷出毒液，留下持续5秒的毒云。在毒云内的敌人会持续受到衰弱之毒，和一个持续衰减的40/50/60/70/80%减速效果，并受到缚地效果而禁止使用位移技能。毒云内的敌人也会每秒受到20/35/50/65/80(+0.15)魔法伤害。这个技能有最小施放距离。",
	"skillstat_3a":"基础伤害：20/35/50/65/80",
	"skillstat_3b":"减速幅度：40/50/60/70/80%",
	"skillstat_3c":"冷却时间：18/17/16/15/14",
	"skillstat_3d":"",

	"skilltitle_4":"双生毒牙",
	"skilltip_4":"对目标造成0.55(+0.1)魔法伤害。如果目标被【E双生毒牙】所杀，或在此技能弹道的飞行期间阵亡，卡西奥佩娅获得40/50/60/70/80法力值。如果【E双生毒牙】命中了中毒的目标，那么它会造成10/40/70/100/130(+0.35)额外魔法伤害并为卡西奥佩娅治疗(+)生命值。",
	"skillstat_4a":"额外毒性伤害：10/40/70/100/130",
	"skillstat_4b":"法力消耗：40/50/60/70/80",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"石化凝视",
	"skilltip_5":"卡西奥佩娅对面前的所有敌人造成150/250/350(+0.5)魔法伤害。面对她的敌人会因石化而被晕眩2秒，而背朝她的敌人会被减速40%。",
	"skillstat_5a":"伤害：150/250/350",
	"skillstat_5b":"冷却时间：120/100/80",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 16,
      "bio": "在各维度和各世界间，存在着这么一个地方。有人说它是外来世界，有人则称之为未知空间。事实上，了解的人都知道这个地方叫做虚空世界。虽然名为虚空世界，但这里并非一片荒芜。这里生活着无法形容的生物，笼罩着人类无法想象的恐惧。科加斯就是虚空世界的产物之一，他本性邪恶，提起他的名字都令人毛骨悚然。他的同伴们试图挖通维度边墙，进入符文之地。那里是他们的天堂，可以尽情享受无上的恐惧。他们名为虚空来客，来自古代的可怕生物，所以历史并没有记载。",
      "shortname": "Chogath",
      "name": "虚空恐惧",
      "type2": "2",
	  "type": "24",
	  	"skilltitle_1":"肉食者",
	"skilltip_1":"当科加斯杀死一个单位时，他会回复生命值和法力值。回复的数值会随着科加斯的等级而提升。",
	"skillstat_1":"",

	"skilltitle_2":"破裂",
	"skilltip_2":"使目标区域地面破裂，短时间后将敌人抛向空中1秒，对他们造成80/135/190/245/305(+1)魔法伤害，并减少他们60%的移动速度，持续1.5秒。",
	"skillstat_2a":"伤害：80/135/190/245/305",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"野性尖叫",
	"skilltip_3":"科加斯向面前锥形区域施放恐怖声波，使范围内的敌人沉默1.5/1.625/1.75/1.875/2秒并造成75/125/175/225/275(+0.7)魔法伤害。",
	"skillstat_3a":"伤害：75/125/175/225/275",
	"skillstat_3b":"冷却时间：13/12/11/10/9",
	"skillstat_3c":"沉默时间：1.5/1.625/1.75/1.875/2",
	"skillstat_3d":"消耗法力：70/80/90/100/110",

	"skilltitle_4":"恐惧之刺",
	"skilltip_4":"激活：普通攻击会发射尖刺，对面前一条线的敌人造成20/35/50/65/80(+0.3)魔法伤害。这些尖刺会在科加斯获得盛宴层数后变宽。",
	"skillstat_4a":"伤害： 20/35/50/65/80",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"盛宴",
	"skilltip_5":"贪婪地吞吃一名敌人，造成300/475/650(+0.7)真实伤害或对野怪和小兵造成1000(+0.7)真实伤害。如果科加斯用【盛宴】击杀了敌方单位，那么他就会获得一层盛宴效果，每层效果都会使他的体型变大且提供100/140/180最大生命值加成。用此技能击杀英雄时会额外获得一层盛宴效果。用此技能击杀野怪或小兵会返还此技能50%的冷却时间和法力消耗。科加斯身上的盛宴效果不会超过6层，并且在死亡时会损失一半的层数。",
	"skillstat_5a":"对英雄的伤害：300/475/650",
	"skillstat_5b":"每层效果的生命值加成：100/140/180",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 17,
      "bio": "黑默丁格和他约德尔大陆的同伴移居到皮特沃夫后，就将科学当作日常生活的一部分。他们很快就为科技魔法社区做出了突破性的贡献。约德尔人虽然个子矮小，但勤奋弥补了先天不足。库奇凭借成功的试飞获得了英勇投弹手的头衔。 他试飞的是专为前线侦查行动部门(ROFLC)而设计的新型空袭飞机。这个机型也成为了班德尔城远征军(BCEF)的支柱。库奇和他的飞行战队“尖啸之蛇”常常翱翔于瓦洛兰的天空观察地形，也为观众表演空中特技。",
      "shortname": "Corki",
      "name": "英勇投弹手",
      "type2": "2",
	  "type": "5",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 18,
      "bio": "提到诺克萨斯力量的象征，没有人能比德莱厄斯这名城邦中最让人畏惧和久经沙场的战士更加适合了。自幼失去双亲的德莱厄斯，为了让他自己和弟弟活下去，不得不进行战斗。到他加入军队的时候，他已经练就出了如同身经百战的老练士兵一般的力气和纪律性。德莱厄斯决心的首次真正考验，出现在一次对抗德玛西亚的决定性战斗中。那里的诺克萨斯军队疲惫不堪，且数量处于劣势。德莱厄斯的长官下令，让他的部队撤退，但德莱厄斯拒绝接受如此怯懦的行为。德莱厄斯脱离编队，大步迈向长官，并用手中的巨斧削掉了这个胆小鬼的脑袋。",
      "shortname": "Darius",
      "name": "诺克萨斯之手",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 19,
      "bio": "“我即是那追逐月之魂的皎白之光。”黛安娜永远都佩着她的月刃，她是皎月教派的武士，不过她的教派在巨神峰周围地区几乎已销声匿迹。黛安娜是皎月神力的凡间化身，身穿微光闪烁的铠甲，就像冬夜的飘雪一样发出寒光。它在巨神峰之巅接受了星灵精魄的融合，已经不再是单纯的凡人，现在的她努力抗争着，寻找着神的启示，寻找自己的力量和存在于这个世界的意义。",
      "shortname": "Diana",
      "name": "皎月女神",
      "type2": "2",
	  "type": "12",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 20,
      "bio": "不同于他的兄长德莱厄斯，战场上的胜利对德莱文来说是绝对不够的。他热切渴望着人们的承认，喝彩，以及荣耀。他先是在诺克萨斯军队里寻求成名的机会，可他的戏剧天资却被严重埋没。带着能与世界分享“德莱文”这个大名的渴望，他将注意力转移到了监狱体系。在那里，他将枯燥无味的例行公事转变成了一个前所未见的奇特景观，并由此获得了梦寐以求的名气。在德莱文首次行刑的时候，他下令让死刑犯逃命。此举震惊了在场的旁观者们。正当死刑犯刚要从视野里消失时，德莱文用一记无可挑剔的飞斧结果了他。",
      "shortname": "Draven",
      "name": "荣耀行刑官",
      "type2": "2",
	  "type": "5",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 21,
      "bio": "“小心这个祖安狂人。在他的眼里，你已经死了。”坊间流传着许多传说，称蒙多医生天生便是无情无义之人。不仅如此，他还有一种无法克制的冲动，渴望通过实验来制造痛苦。五岁时，他所住区域的宠物开始大规模地神秘失踪。十多岁时，他的父母也离奇地从人间蒸发。在他拿到执照开始正式行医以后，他已收到祖安当局发来的38起控告，但都由于证据不足无法将他绳之以法。蒙多医生既是连环杀手，又是顶级的科学狂人，虽然没人能够解释他的杀戮行径是如何和科学扯上关系的。",
      "shortname": "DrMundo",
      "name": "祖安狂人",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 22,
      "bio": "艾克是一名来自祖安不良街区的奇才。他可以操纵时间，从而让任何处境都变得对自己有利。通过使用他自己的发明——Z型驱动——他可以对现实的其它分支的可能性进行探索。在不断试验多维或然率的同时，艾克还将他的时间花费在与祖安的其他走失儿童一起撒野上。尽管他酷爱这种自由自在，但只要他的朋友们遇到了威胁，他就会不顾一切地去保护他们。对于毫不知情的观测者来说，艾克总是在一次又一次且轻而易举地完成着不可能的事情。",
      "shortname": "Ekko",
      "name": "时间刺客",
      "type2": "2",
	  "type": "13",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	  ,{
		 id: 23,
      "bio": "“杀人不见血的，除了利剑，还有美貌。”在诺克萨斯不朽堡垒的地下深处，有一处不见天日的禁地，这是致命的掠食者伊莉丝的宫殿。当她还是一个凡人的时候，她是曾经显赫一时的家族女主人，但是自从被一只阴险的蜘蛛之神咬伤之后，她就化身成了美丽的不死异类。为了永葆青春，伊莉丝孜孜不倦地捕食着无辜的人，而这世上也鲜少有人能够抗拒她的诱惑。",
      "shortname": "Elise",
      "name": "蜘蛛女皇",
      "type2": "2",
	  "type": "12",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	  ,{
		 id: 24,
      "bio": "灵动且致命的伊芙琳是符文大陆上最为致命的——也是收费最高的——刺客之一。她能够随意融入暗影之中，并用这个能力来耐心地追踪她的猎物，等待着合适的机会进行袭击。伊芙琳显然不是一个彻彻底底的人类，她的来历仍然不是很清楚，人们普遍认为她出生于暗影岛——尽管她与那个磨难国度的联系仍然被神秘所笼罩着。",
      "shortname": "Evelynn",
      "name": "寡妇制造者",
      "type2": "2",
	  "type": "23",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 25,
      "bio": "勇敢的年轻探险家伊泽瑞尔已经探索过符文之地上的一些最为偏远和荒废的地区。在对古代恕瑞玛被掩埋的废墟进行探索时，他发现了一个拥有难以置信的神秘力量的护符。可能是做给某个飞升者穿戴的，这个巨大的护符紧套在他的手臂上，将他的原生魔法技术增幅到一个足以让他获得“英雄”名号的程度，让他十分尴尬。",
      "shortname": "Ezreal",
      "name": "探险家",
      "type2": "2",
	  "type": "25",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 26,
      "bio": "20多年来，费德提克独自站在战争学院最东边的召唤室。只有他双眼中发出的燃烧般的绿色火焰才能刺穿他那黑暗、布满尘埃的家。末日使者就是在这里无声地守着。联盟中所有的召唤师都知道他滥用权力，胡作非为的警世故事。几十年前，有个来自祖安的强大符文魔法师，他的名字叫艾斯特凡。第五次符文战争后，他成为联盟第一召唤师。受到旧魔法的毒害太深，艾斯特凡越来越偏离联盟的法则。在最后的比赛中，他终于无法自我控制，将自己封闭在最东边的召唤室，并开始念仪式最禁止的咒语——超二维的召唤。",
      "shortname": "FiddleSticks",
      "name": "末日使者",
      "type2": "2",
	  "type": "26",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 27,
      "bio": "“我以荣誉之名前来杀你。即使你毫无荣誉可言，也一样得死。”菲奥娜是瓦洛兰的决斗家中最为可怕的一个，她的名声来自她唐突的举止和精明的头脑，以及与这些相称的对蓝钢刺剑的挥舞速度。她出生在德玛西亚王国里的劳伦特家族，并在一次几乎要毁掉家族的丑闻后，从她父亲那里夺过了家族的控制权。劳伦特家族的声望已经一落千丈，但菲奥娜在竭尽全力地恢复家族的荣耀，并让家族重新回到德玛西亚的名门望族之列。",
      "shortname": "Fiora",
      "name": "无双剑姬",
      "type2": "2",
	  "type": "13",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 28,
      "bio": "几个世纪以前，一种名叫凯玛的水生种族在征服者之海的一座海底山脉下修建了一所城市，阿纳波斯，虽然凯玛族人树敌众多，但是有这座坚不可摧的堡垒保护着他们。由于这座城池所提供的超然安全感，凯玛族民们逐渐的变得自满起来。但是，凯玛族中一名叫菲兹的成员仍然怀有那种无法满足于安稳祥和的生活的探索之心。这一天性使它完全无法抵御惊险刺激所带来的诱惑，所以菲兹常常自己偷偷跑出城外去探险。经历过种种危险之后，菲兹成长为了一名经验丰富的战士。",
      "shortname": "Fizz",
      "name": "潮汐海灵",
      "type2": "2",
	  "type": "13",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	  ,{
		 id: 29,
      "bio": "“这个世上没有赎罪，只有忏悔。”虽然今日早已明令禁止向傀儡假人灌输思想，但在以前，很多工匠专家却觉得这种行为再正常不过，法师们很早就对创造人造生命进行试验。有这样一位充满幻想的德玛西亚工匠，杜朗，他制作人造生物的手艺无与伦比。杜朗为他挚爱的城邦周边的小镇设计了不知疲倦的卫士，保护他们免受诺克萨斯的侵犯。杜朗则留着杰作加里奥保护自己。这个强大的造物确保了杜朗旅途的安全，让他无畏那些对他家园充满敌意的人，全心全意完成自己重要的工作。然而，这最终激怒了诺克萨斯的最高指挥部。",
      "shortname": "Galio",
      "name": "哨兵之殇",
      "type2": "2",
	  "type": "24",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 30,
      "bio": "“小子，在你还在尿裤子的时候，我就已经在杀人越货、击沉诺克萨斯的战船了。你想和我作对？”诡计多端、心狠手辣的普朗克自封为强盗之王，他用威慑、暴力和权谋统治着比尔吉沃特。他所到之处，定会留下死亡和废墟，所以，他声名狼藉、臭名远扬，只要他的黑帆刚刚露出海平面，无论多么老练的船队水手都会手忙脚乱。",
      "shortname": "Gangplank",
      "name": "海洋之灾",
      "type2": "2",
	  "type": "1",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 31,
      "bio": "在瓦洛兰大陆，虽然人们对德玛西亚的军纪存在争议，但是相同点是所有人都尊敬它。平民和士兵都严格遵守着“零容忍”的准则。这意味着在战斗中徳玛西亚军队永远不会找借口托辞、逃跑、或者投降。至高的军队领袖们强力地执行着这些原则。盖伦——拥有“德玛西亚之力”头衔的英勇勇士，就是军队的模范。成千上万的英雄在德玛西亚和诺克萨斯（德玛西亚的敌对阵营）战场上浴血奋战，战死沙场。在军旗下，盖伦遇到了旗鼓相当的对手——刀锋女王卡特琳娜。",
      "shortname": "Garen",
      "name": "德玛西亚之力",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 32,
      "bio": "丛林不会原谅盲目与无知。每根断枝都在讲述着故事。我已经猎遍了这个丛林里的所有生物。我确信，这儿以前已经没剩下什么挑战了，但现在，这儿有了新来客。它的脚印和长牙领主一般大小；它的爪子就像弯刀。它能把人撕成两半。总算碰到有价值的猎物了。在我穿越丛林追踪我的猎物时，我开始看到这家伙所造成的破坏。我踏进了一个由破裂的树木们形成的怪异圆环。这些巨大的木质哨卫们已经在这片土地上矗立了无数岁月，它们铁一般的树皮，曾让那些手拿破斧又想砍伐它们的蠢货们无可奈何。",
      "shortname": "Gnar",
      "name": "迷失之牙",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 33,
      "bio": "对古拉加斯而言，喝酒，是唯一一件比战斗还要重要的事。他对酒劲更强的麦酒有着难以抑制的渴求。在这种渴求的驱使下，他不断寻找着酒劲最强、最不寻常的原料来进行蒸馏。这个行事冲动、难以预测的吵闹酒徒，最喜欢的活动就是砸酒桶和砸脑袋。拜他那古怪的酒水和喜怒无常的脾气所赐，和古拉加斯一起喝酒永远是一个危险的提议。古拉加斯对佳酿有着矢志不渝的爱，但他巨大的体格总是阻止他进入那种飘飘欲仙的醉酒状态。",
      "shortname": "Gragas",
      "name": "酒桶",
      "type2": "2",
	  "type": "12",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 34,
      "bio": "马尔科姆·格雷福斯的足迹遍布整个大陆，他在许多领地、城市和帝国都是通缉要犯。格雷福斯粗狂不羁、意志坚定，而且残忍无情无人能及，他一生的犯罪恶行为他积攒了（随后又不可避免地失去了）一笔小财。",
      "shortname": "Graves",
      "name": "法外狂徒",
      "type2": "2",
	  "type": "5",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 35,
      "bio": "“无情利刃所向，尽皆披靡。恐惧铁蹄之下，生灵涂炭。”赫卡里姆是一只披坚执锐的庞然大物，从暗影岛狂奔而出，带领着一群幽灵骑兵猎杀鲜活的生命。赫卡里姆是人与野兽的融合体，诅咒让他永世狂奔，杀戮让他欣喜若狂，铁蹄让他碾压一切生灵。",
      "shortname": "Hecarim",
      "name": "战争之影",
      "type2": "2",
	  "type": "15",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 36,
      "bio": "在班德尔城之外，鲜有人能看到约德尔人的踪影，然而黑默丁格却抵挡不了科学的诱惑。在他获得第三个博士学位的时候，他已经成为约德尔人最伟大的科学家，而他的家也几乎没有他的容身之地了。远在北方的皮特沃夫的大学院向他抛出了橄榄枝，希望他能在进步之城做出自己的成就来。黑默丁格深知离开自己的种族便难以成功，于是他召集了志同道合的约德尔人加入他，现在这些人都成了著名的约德尔科学和发展学院的中流砥柱。从那以后，黑默丁格成为了当代最受尊敬的科学家之一，而他的学院也成了整个瓦洛兰的出类拔萃的学院之一。",
      "shortname": "Heimerdinger",
      "name": "大发明家",
      "type2": "2",
	  "type": "26",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 37,
      "bio": "''说教无益。折断的骨头是更好的课本。''俄洛伊的体格强横无比，却唯独会在她的坚定信仰面前屈身。作为大海兽的先知，她挥舞着一个巨大的金色神像，将敌人的灵魂抽离体外，将他们对现实的感知完全击毁。所有对“娜伽卡波洛丝的真者”发起挑战的人，很快就会发现，俄洛伊从来不单打独斗——蟒行群岛的众神会与她并肩作战。",
      "shortname": "Illaoi",
      "name": "海兽祭司",
      "type2": "2",
	  "type": "14",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 },{
		 id: 38,
      "bio": "“那把剑狂乱飞舞，仿佛蘸血为画。”艾欧尼亚人创建出了符文之地上最令人叹为观止的致命武艺，但这仅仅只是他们追求极致的表现之一。他们最卓越的剑术却是诞生于防御外敌入侵时的副产物。里托大师是一位声名远扬的剑客，他受邀担任过几乎所有城邦的剑术教练。他的剑据说会呼吸吐纳，而他的剑术更是受到了高度的保密。谁也没想到，天降奇瘟，所有大夫都对此手足无措，大师身染此病，遽然仙逝了。里托大师死后留下一双儿女，泽洛斯和艾瑞莉娅，此外还有他那把传奇的独门武器。",
      "shortname": "Irelia",
      "name": "刀锋意志",
      "type2": "2",
	  "type": "13",
	  	"skilltitle_1":"",
	"skilltip_1":"",
	"skillstat_1":"",

	"skilltitle_2":"",
	"skilltip_2":"",
	"skillstat_2a":"",
	"skillstat_2b":"",
	"skillstat_2c":"",
	"skillstat_2d":"",

	"skilltitle_3":"",
	"skilltip_3":"",
	"skillstat_3a":"",
	"skillstat_3b":"",
	"skillstat_3c":"",
	"skillstat_3d":"",

	"skilltitle_4":"",
	"skilltip_4":"",
	"skillstat_4a":"",
	"skillstat_4b":"",
	"skillstat_4c":"",
	"skillstat_4d":"",

	"skilltitle_5":"",
	"skilltip_5":"",
	"skillstat_5a":"",
	"skillstat_5b":"",
	"skillstat_5c":"",
	"skillstat_5d":"",
	 }
	 ,{
		 id: 39,
      "bio": "人们所说的翠神，真正的名字是艾翁·荆足。半人半树的它，常在符文之地的丛林中游荡，所经之处无不生机盎然。他知晓自然界的种种秘密，无论是飞禽走兽还是游鱼虫孑，都与他交谊深厚。在逍遥四野的途中，艾翁会向路遇的人传授奇特的智慧，或是培植丰茂的丛林。时不时地，他也会向口风不严的蝴蝶托付自己所知的秘密。",
      "shortname": "Ivern",
      "name": "翠神",
      "type2": "2",
	  "type": "26"
	 } ,{
		 id: 40,
      "bio": "有些魔法师为了追求自然的原始力量，甘愿放弃已经学成的魔法。迦娜就是这样一位魔法师。她是个在祖安的混乱中成长的孤儿，她起初学习的是魔法 。迦娜竭力地保护路上的小生物。虽然生活对于这个美丽的女孩而言艰苦且危险，但她凭借着自己的智慧生存了下来，当智慧不够时，她便依赖偷窃。祖安猖獗的魔法是极具诱惑的，迦娜也意识到这种魔法能够保护且提升自己。迦娜发现自己对一种特殊的魔法情有独钟——自然空气魔法。她好像专为此魔法而生，只花了数月的时间就掌握了空气魔法。",
      "shortname": "Janna",
      "name": "风暴之怒",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 41,
      "bio": "“世间唯一的真理就在我长矛的尖儿上。”作为德玛西亚正统皇室光盾家族的成员，几个世纪以来他们都在与那些反对德玛西亚准则的敌人作战。据说每个光盾族人生来骨子里就有一股反诺克萨斯的情绪，嘉文四世也是如此。他效仿先人，带领德玛西亚军队和诺克萨斯军队浴血奋战。嘉文四世和他的军队并肩作战，英勇负伤。他曾败于杰里柯·斯维因之手，被一支诺克萨斯军队智取并俘虏。这个惨痛的失误，嘉文四世差点丧命于厄加特之手，幸好童年伙伴盖伦带领着无畏先锋军团，将他解救出来。",
      "shortname": "JarvanIV",
      "name": "德玛西亚皇子",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 42,
      "bio": "除了贾克斯，很少有英雄是通过加入联盟后的行动来衡量自己。贾克斯是目前战争学院最多产的联赛战士。在加入联盟之前，贾克斯只是个平凡的雇佣士兵。贾克斯被放在了联盟裁决候选人名单的首位，理由只有联盟的前领袖——高级议员瑞吉纳德丶阿什拉姆才知道。联盟裁决的面试结果只有两个：要么选择一名未来英雄、要么拒绝。贾克斯的裁决是联盟历史上最快的。验证之门在一开始就发光，且慢慢地打开。贾克斯在裁决期间面对的是没有记录的观察和考虑。贾克斯向世人证明自己是当前正义之地最恐怖的存在。",
      "shortname": "Jax",
      "name": "武器大师",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 43,
      "bio": "武装着睿智与魅力，以及标志性的可变形铁锤，杰斯毕生致力于守护他的祖国，皮尔特沃夫。靠着发明家的身份而闻达于世的他，用充满磁性的人格以及创意新颖的作品照亮了城邦人民的生活。不过，他的诸多技术奇迹也吸引了皮尔特沃夫的敌人们的注意力。维克托，这个用机械强化身体的祖安科学家，对杰斯的实验室发动了一次致命的袭击。在受到实验室贫乏的安防部队那形同虚设的阻碍后，维克托偷到了一个奥能转换器的设计图。杰斯担心维克托会用偷来的技术制造毁灭性武器。他恳求皮尔特沃夫政府作出回击，但官员们不愿意对一个侵略性的行为作出支持。",
      "shortname": "Jayce",
      "name": "未来守护者",
      "type2": "2",
	  "type": "15"
	 },{
		 id: 44,
      "bio": "“艺术需要相当程度的…残忍。”作为一名心思缜密的癫狂杀手，烬坚信谋杀是一门艺术。他曾在艾欧尼亚的监狱中服刑，但却因为执政议会里涌动着的暗流而得到释放，成为了权术斗争所利用的刺客。烬将手中的枪当成画笔，尽情地挥洒他所追求的残忍艺术，让受害者肝胆俱裂，令旁观者震悚难平。他在自己制作的阴森剧目里肆意取乐，让“恐怖”二字有了最合适不过的，使者。",
      "shortname": "Jhin",
      "name": "戏命师",
      "type2": "2",
	  "type": "35"
	 },{
		 id: 45,
      "bio": "金克丝活着就是为了不计后果的四处肆虐，在她身后留下的只有一片混乱与恐慌。她是一名暴躁而残忍的罪犯，她蔑视一切仅仅是因为无聊，她会在她认为最无趣的地方：皮尔特沃夫，欢乐地进行带着她烙印的肆虐，以引起混乱。她携带着兵工厂里的致命玩具，她引发着最闪耀而响亮的爆炸——这也是为了引起倒霉的当局的震惊与注意。金克丝总是能够逍遥法外，她最爱的游戏就是戏弄皮城的警察——尤其是蔚。皮尔特沃夫一直被誉为进步之城，和平与秩序在此彰显。但一名新的罪犯的到来却向这里的宁静发起了史无前例的挑战。",
      "shortname": "Jinx",
      "name": "暴走萝莉",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 46,
      "bio": "“被冤枉时，我们寻求正义。被伤害时，我们进行回击。被出卖时，复仇之矛无情出击。”卡莉丝塔是充满复仇怨念的幽灵，是不灭的复仇之魂，是召唤自暗影岛的噩梦，专门猎杀背信弃义之人。背叛行为的受害者会以血泪盼望复仇，但卡莉丝塔只会挑选那些她认为正当的理由，回应召唤，施展自己的杀人技艺。所有被卡莉丝塔盯上的人都将不可避免地遭遇不幸，因为这位死亡猎手终结誓约的方式只有一种，那就是她灵魂标枪上的冷酷灵火。",
      "shortname": "Kalista",
      "name": "复仇之矛",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 47,
      "bio": "卡尔玛是一位有着不屈意志和无拘灵力的女性。她是显灵的艾欧尼亚之魂，战场上的精神支柱，保护友军击退来犯之敌。卡尔玛是一个强大的领袖，在传统和革新之间艰难地探寻着保卫艾欧尼亚和平局面的方式——迫不得已时，也会动用武力。卡尔玛曾在一个艾欧尼亚的小村庄里度过了一段平静的生活。在年长僧侣的指引下，村民们实行着一种有关仁慈魔法与和平主义的传统习俗。卡尔玛以她与精神领域的强大联系而闻名，并被她的人民们视为公正的调停者来拥戴，因此，她将这些传统习俗看作是被所有艾欧尼亚人所寻求的启迪之道的一种本质。",
      "shortname": "Karma",
      "name": "天启者",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 48,
      "bio": "“死亡不是旅程的终点，而是起点……”卡尔萨斯是湮灭的使者，狂热地投入到死亡的美丽与清晰中。在他年轻时，他就完全沉迷于死亡的魅力中，并在追求他的黑暗欲望时变得越来越无情。渴望着与死亡合为一体的卡尔萨斯前往暗影岛，并欣然将自己献身于亡灵。卡尔萨斯转变成了死亡颂唱者，一个世间仅存的可怕巫妖，派发着受湮灭祝福的礼物。",
      "shortname": "Karthus",
      "name": "死亡颂唱者",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 49,
      "bio": "在众多的纬度和世界间，存在着这么一个地方。有人说它是外域，有人则称之为未知空间。事实上，了解的人都把这个地方叫做虚空。虽然名为虚空，但这里并非一片荒芜。这里生活着无法形容的生物，笼罩着人类无法想象的恐惧。虽然这些知识现在已经失传，但却有人不经意间发现了其背后的故事。卡萨丁就是其中一员。他曾经被迫看到虚空来客的脸，且因此永远改变了自己。作为一个禁忌知识的寻找者，卡萨丁发现他寻找的完全是其他东西。他是极少数找到被遗忘的艾卡西亚，并且能活着诉说那段神话的人，包括那些古代文字里隐藏的只言片语。",
      "shortname": "Kassadin",
      "name": "虚空行者",
      "type2": "2",
	  "type": "23"
	 },{
		 id: 50,
      "bio": "卡特琳娜生于诺克萨斯的权贵之家，从小就接受匕首的训练。现在那位火爆任性的小姑娘已经长大，美丽而致命。对家族的责任和忠诚缓和了火爆的性格。事实早已证明，在自我与责任之间出现分歧时，卡特琳娜火爆的激情就会变成一把双刃剑，伤人伤己。作为诺克萨斯将军的女儿，卡特琳娜生性自由奔放，年幼的卡特琳娜在各方面都得到了最好的照顾。在战斗中，她发现自己被刀刃所吸引，而她的天赋也展现出来。卡特琳娜在诺克萨斯军队里接受成为最致命刺客的训练，让整个家族都为之骄傲。",
      "shortname": "Katarina",
      "name": "不祥之刃",
      "type2": "2",
	  "type": "23"
	 },{
		 id: 51,
      "bio": "在上古战争肆虐的遥远世界中，凯尔是一位伟大的英雄。她是神秘的永生一族中最强壮的英雄，并致力于消灭一切邪恶。一万年来，她遮住自己动人的面孔，隐藏自己娇弱的身躯。她穿着已经灭族的巧匠氏族唯一存世的杰作——光明圣甲，挥舞着她那把铸造于光阴诞生前的流火之刃，为她的族人不知疲倦地战斗着。战争一步步摧残她的灵魂。在追寻胜利的过程中，有时她会拯救那些陷入泥沼的罪人，但更多的时候，她会将无可救药的恶徒们彻底消灭。对凯尔来说，正义往往也是丑恶的。",
      "shortname": "Kayle",
      "name": "审判天使",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 52,
      "bio": "艾欧尼亚岛上存在一个上古教派，致力于维护均衡。规则与混乱、光明与黑暗——万物必须和谐共存，这就是宇宙的真理。该教派名为均衡教派，维护世界均衡的神圣使命则由三个暗影战士来执行。凯南便是这三名暗影战士中一员，肩负着逐日的神圣职责--不知疲倦地宣扬着均衡教派的正义。凯南出生在班德尔城，他从娘胎里快速蹦出来，然后又闪速般挣脱接生婆的手。他父母原以为他精力有限，不料随着他慢慢成熟，不仅精力旺盛，速度也惊人。尽管他天赋异禀，却默默无闻（或者说他暂时未因顽皮而被抓）。",
      "shortname": "Kennen",
      "name": "狂暴之心",
      "type2": "2",
	  "type": "25"
	 },{
		 id: 53,
      "bio": "一头来自虚空、名为卡兹克的恶毒掠食者渗入了瓦洛兰，准备吞噬这块大陆上最有潜力的生物们。每次猎杀后，他都会吸收掉猎物的力量，让自己进化得更加强大。卡兹克最渴望征服和吞噬的对象是雷恩加尔，一只与他实力在伯仲之间的野兽。当卡兹克刚刚穿越到这个世界时，他非常地脆弱和饥饿。他最先遇到的一批动物实在是太弱小了，难以为他的快速进化提供给养。于是，卡兹克将他的目光转移到他所能找到的最为危险的生物上，即便冒着生命危险，也要满足进化所需的给养。每次击杀都让他大快朵颐，焕然一新，变成更强更快的掠食者。",
      "shortname": "Khazix",
      "name": "虚空掠夺者",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 54,
      "bio": "“再跟我说一次，小羔羊，哪些东西是我们要拿走的？”“所有东西，亲爱的恶狼。”各成一体但永不分离的千珏代表着死亡的双生本质。羊灵的箭矢是为那些接受命运的人们所提供的一次迅速释放。狼灵则会捕猎那些想要从自身寿命终点逃离的人们，并在他的血盆大口内为他们献上暴力的结局。尽管符文之地各个地方对千珏天性的解释不尽相同，但每个凡间生灵都必须选择自身死亡的真实面目。",
      "shortname": "Kindred",
      "name": "永猎双子",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 55,
      "bio": "“正常人都会跑……但我不需要！”广受喜爱的民间英雄、无畏无赖的凶猛战士、诺克萨斯的意志化身、帝国士兵的仰慕偶像、长官眼里的定时炸弹、贵族鄙夷的送死小卒……克烈身上的光环可谓数不胜数。诸如“伟大的轻骑兵”、“高阶少将元帅中士”和“山中大将”一类的逸闻可以一直追溯到帝国初建的时日。很多军士都说，克烈参与了有史以来军团所挑起的每一场征战，“获得”了军中的每一份头衔，而且从来没有却步于任何一次战斗。",
      "shortname": "Kled",
      "name": "暴怒骑士",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 56,
      "bio": "“如果那只是饥饿，我不愿看到愤怒。”当虚空先知玛尔扎哈在艾卡西亚重生时，充满凶意的呼唤就占据了他的心智，从此指引着他的方向。呼唤的声音在他的内心烙下了恐怖的意志，虽然玛尔扎哈不再把这种呼唤当作一种折磨，但他再也无法阻止脑海里不断盘旋的回音。现在驻留在符文之地的邪恶声音唤起了一头令人厌恶的野兽，它从容地跨入了一个无法理解的世界，也撕开了不同时空之间的裂痕。在艾卡西亚鬼灵频现的废墟中，克格莫来到了瓦洛兰大陆，表现出令人不安的好奇心。那引领他通往符文之地的闪光挑逗着他，催促他走向玛尔扎哈。",
      "shortname": "KogMaw",
      "name": "深渊巨口",
      "type2": "2",
	  "type": "25"
	 },{
		 id: 57,
      "bio": "每个城市都有你所不知的一面，正如每个人也都有着不为他人所知的一面。诺克萨斯，就是这么一个让人又爱又恨的地方。在幽暗的街道深处，地牢宛如密密麻麻的蜂巢随处可见。蜿蜒的街道顺着地下城中心不断延伸出去，这里成为了世间万恶的避难所。无数狂热教徒、邪恶女巫、秘密团体都将这座迷宫视为家园。而“诡术妖姬”乐芙兰则是“黑色玫瑰”组织的首领，该组织是诺克萨斯历史上一段难以启齿时期的遗留产物。",
      "shortname": "Leblanc",
      "name": "诡术妖姬",
      "type2": "2",
	  "type": "23"
	 },{
		 id: 58,
      "bio": "年轻的李青立志要成为一名召唤师，他的决心和奉献精神是同龄人无可比拟的。李青的才华引起了当时的联盟高级议员——瑞吉纳德丶阿什拉姆的注意。在学习奥术星座魔法时，他对接受和其他学生一样的课程感到沮丧，他的业余时间都在研究召唤的细微差别，希望能够早日掌握精髓。李青的奥术学习进步很快，远远超过了其他同学。如果没有那个事故，李青无疑将成为联盟最伟大的召唤师之一。迫不及待的李青想召唤来自瘟疫丛林的野兽，来证明自己的能力。然而，他并没有成功召唤野兽，却召唤出了一个四分五裂的小男孩。",
      "shortname": "LeeSin",
      "name": "盲僧",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 59,
      "bio": "“若要如烈阳般光芒四射，先要如烈阳般燃烧自己。”蕾欧娜是被灌注了烈阳之火的烈阳教派圣殿武士，用天顶之剑和破晓之盾守护着巨神峰。她的皮肤闪烁着星火，她体内天界星灵的力量透过她的双眼炯炯燃烧。蕾欧娜身披金色铠甲，背负着沉重的上古知识，为一些人带来启示，为另一些人带去死亡。",
      "shortname": "Leona",
      "name": "曙光女神",
      "type2": "2",
	  "type": "46"
	 },{
		 id: 60,
      "bio": "丽桑卓的魔法将纯净的冰霜之力扭曲为某种黑暗而可怕的东西。伴随着她的黑色冰霜之力，她不仅冻结敌人，还能将他们刺穿并粉碎。对于北部饱受恐吓的居民来说，她只是被称为“冰霜女巫”。但事实却更为凶险：丽桑卓是个本质上的堕落之人，她阴谋释放能力将世界转变成冰河世纪。数个世纪以前，丽桑卓以返还能力为目的背叛了她的部族并向被称为“冰霜守望者”的邪恶生物投诚。那也是温暖的血液在她静脉中流淌的最后一天。伴随着她堕落的部族和守望者的力量，她像一场可怕的暴风雪般扫荡着这块大陆。",
      "shortname": "Lissandra",
      "name": "冰霜女巫",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 61,
      "bio": "卢锡安将灌输着远古力量的遗物作为武器，以坚定守护神的身份对抗着亡灵生物。他冷酷的信念从未动摇，即使面对着令人发狂的恐惧，他也会咆哮着用圣焰将之毁灭。卢锡安独自承受着一项残酷的任务：净化那些被亡灵生物诱捕的灵魂，他的永远挚爱也在此之中。正如他们装配的双生遗物武器一般，卢锡安和他的妻子赛娜如同用相同的石头雕刻而成。他们共同在符文大陆战斗多年，将圣光带向黑暗，净化那些被腐败夺走的人们。他们是正义的风向标：赛娜对事业的奉献从未迟疑，卢锡安的友善与热心则感动了许多被他们拯救的生命。",
      "shortname": "Lucian",
      "name": "圣枪游侠",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 62,
      "bio": "璐璐率性而为的程度，也许联盟中没有哪个英雄能够比得上。在班德尔城中度过的青春岁月中，她总是把大部分时间都花在林间漫步或者做白日梦上。这并不表示她不合群；班德尔城日复一日的喧嚣，根本比不上她想象中的那个多姿多彩的世界。在大部分人丝毫不会留意的地方，她却能看见奇迹。就是因为这点，淘气的小仙灵，皮克斯,在往鸟舍里钻的时候被她给发现了。璐璐的想象力使她把自己看成是皮克斯的同类，而皮克斯也发现了将她诱引到他的世界之中的机会。他将她带进了仙灵们引人入胜的家园——坐落于一块林间空地旁边的奇幻仙境。",
      "shortname": "Lulu",
      "name": "仙灵女巫",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 63,
      "bio": "拉克丝出生于享有声望的冕卫家族，在德玛西亚军队模范家庭的氛围里，她注定是不平凡的。她是家里唯一的女孩，接受了高等教育，参加只有名门望族才能参加的奢华宴会。伴随着拉克丝的成长，她独特的天赋渐渐崭露头角。她喜欢恶作剧，让人家对实际上并不存在的东西信以为真，她还能隐藏在显眼的地方。不知为何，再神秘的魔法技能，她只要看过一次，就能够依葫芦画瓢反转施放。拉克丝被誉为天才，她的一举一动都牵动着德玛西亚政府、军队和人民的心。",
      "shortname": "Lux",
      "name": "光辉女郎",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 64,
      "bio": "有一个十分和谐的地方，那里万物归一。熔岩是所有创造物的精华，这里的居民都是特别的组成部分。这个地方对称、完全稳定，因此极其美丽。在这里居住的熔岩生物都清楚自己的身份，并全力履行自己的责任。他们像群居生物或蜂巢那样工作和生活。墨菲特总是努力付出自己的全部潜能，作为整体的一部分。他是一个杰出的生物，履行着维持族人完美秩序构想的任务。有一天，空间裂谷在毫无预警的情况下打开了。墨菲特跨越宇宙，被召唤到符文之地。",
      "shortname": "Malphite",
      "name": "熔岩巨兽",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 65,
      "bio": "大部分人在恕瑞玛烈日的眩光下变得疯癫，而玛尔扎哈却在暗夜的拥抱中失去了心智。玛尔扎哈天生便是一位预言家。尽管他的才能尚未达到炉火纯青的境界，但他的能力却是符文之地的最大恩惠。由于他对命运的复杂多变有着强烈的感知，致使一些不受欢迎的事物趁虚而入，逐渐地侵蚀着他的潜意识。在他的梦里，隔离之纱最薄弱的地方，一个邪灵正在召唤他。起初，玛尔扎哈尚能抵御这强烈的蛊惑，然而随着时间的流逝，召唤之声越来越强烈，直到玛尔扎哈再也无法抗拒。",
      "shortname": "Malzahar",
      "name": "虚空先知",
      "type2": "2",
	  "type": "23"
	 },{
		 id: 66,
      "bio": "“我四周围绕的全都是空洞的躯壳，没有灵魂，不知敬畏...但我将给他们带来恐惧。”茂凯是一只内心暴怒外形魁梧的树精，不知疲倦地对抗暗影岛的骇人异象。一场魔法灾变摧毁了他的家园，同时也将他变成一股复仇的力量，使他免遭不死诅咒的，全靠他芯中灌注融合的生命之水。曾经的茂凯是一只平和的自然之灵，而现在的他则一直在暴怒地战斗，只为了将不死的灾祸逐出暗影岛，让他的家园重归往日的秀美。",
      "shortname": "Maokai",
      "name": "扭曲树精",
      "type2": "2",
	  "type": "24"
	 },{
		 id: 67,
      "bio": "通过远古的无极之道，易大师调节身体并磨练心智，直至身心合一。尽管他将暴力作为不得已的选择手段，他优雅迅速的舞剑速度却能让他快速解决问题。作为无极之道最后的门徒，易大师将生命奉献于找寻可以继承这份财富的弟子。事实上在易精通无极之道前，他便已被视为这个神秘之道最具天赋的继承者之一。他也很快在一次诺克萨斯大规模袭击他所居住的偏远村庄时证明了自己的天赋。易横扫艾欧尼亚的战场，利用迅捷而致命的攻击击退了诺克萨斯大量的步兵团，甚至让诺克萨斯的高层陷入窘境。",
      "shortname": "MasterYi",
      "name": "无极剑圣",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 68,
      "bio": "“风险越大，赏金越多。”无论是美貌颜值还是危险指数，鲜有人能在任何一方面与厄运小姐媲美。作为比尔吉沃特最负盛名的赏金猎人，她的传奇故事建立在无数密布着弹孔的尸体和被捕获的混混们之上。只要比尔吉沃特那臭烘烘的码头和拾荒者棚屋中回响起她标志性的双枪，赏金告示板上的悬赏令就又少了一张。",
      "shortname": "MissFortune",
      "name": "赏金猎人",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 69,
      "bio": "在战争学院里，有很多来自异世界的英雄，其中的大部分都是被召唤师们给“请”来的，而另一小部分，则不请自来。齐天大圣孙悟空，就是其中之一。成佛后的平淡生活，让生性贪玩的孙悟空感到枯燥不已。在一次神游异世的过程中，他发现了符文大陆这个能量波动异常频繁的世界。他开始深入了解这个世界，并且被英雄联盟公正独特的战斗方式，以及各具特色的英雄们唤醒了他内心深处沉睡已久的战斗之心。于是，他将魂魄一分为二：斗战胜佛与齐天大圣。前者继续留在佛界，受世人供奉。",
      "shortname": "MonkeyKing",
      "name": "齐天大圣",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 70,
      "bio": "“万物皆有一死……唯我可得永生。”名叫莫德凯撒的恶毒怨灵是萦绕于暗影岛上的一个最为可怖和可憎的灵体。被埋葬在古代铠甲中的冥魂之主据说是第一个不死灵体，甚至还是一个在暗影岛被改造前就存在的怨魂。他扭曲的灵魂，因他的苦痛和他对其他人施加的痛苦而增长着。那些胆敢在战争中直面莫德凯撒的人，将遭到可怕的诅咒：他会奴役被害者的灵魂，并让他们成为毁灭的工具。",
      "shortname": "Mordekaiser",
      "name": "铁铠冥魂",
      "type2": "2",
	  "type": "1"
	 },{
		 id: 71,
      "bio": "有一个遥远的地方，那里住着永生飞行的生物，优雅而美丽，但远古战争肆虐。和很多战争一样，这场战争让人家破人亡。一方宣称自己是完美守序和正义的，他们作战是为了用自己的法律和强力中央统治来统一世界。另外一方把他们视为专制统治者，认为他们目光短浅，为了效率和安全牺牲个人和自由。莫甘娜就是那个与专制统治者抗战的人，因此她被称为“堕落”。莫甘娜不是无辜的，她探究秘法来获得禁忌力量，最终成为黑暗魔法强大的主人。这都是为了打败敌方将军——她的姐姐凯尔。莫甘娜和凯尔是同胞姐妹。",
      "shortname": "Morgana",
      "name": "堕落天使",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 72,
      "bio": "娜美引导着海洋的原始能量，来统御海洋神秘的恢复特性，并号令潮汐本身的狂野能量。尽管被大部分人质疑，娜美仍然具有承担起一个没有人愿意承担的危险使命的勇气和决心。现在，她的人民坚信她是唤潮者，一个命中注定要去完成一项事关她整个族群生存的使命的天选之人。唤潮者的神圣使命是去获取一个月石，一个仅在地表世界的高耸山巅上找到的物体。她的人民，鲛人族，依赖月石的光芒来避开深渊里的恐惧之物。不过，月石的能量只会持续一百年。",
      "shortname": "Nami",
      "name": "唤潮鲛姬",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 73,
      "bio": "“兴衰之轮永不停转。”内瑟斯在远古时代的恕瑞玛就已存在，他是一位长着狐狼脑袋的飞升者，恕瑞玛的人民奉他为英雄——甚至是半神一般的存在。怀着超绝的智慧，他作为知识和谋略的守护者，英明地指导着古代恕瑞玛的人民获得了数个世纪的辉煌。帝国覆灭之后，他对自己进行了自我放逐，慢慢成为了一个堪比传说的存在。随着恕瑞玛的再度兴起，带着永不让帝国再次衰落的宏愿，内瑟斯回来了。",
      "shortname": "Nasus",
      "name": "沙漠死神",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 74,
      "bio": "从前，诺提勒斯曾是一名受战争学院委任，去探索守护者之海未知流域的海员。这次远征曾让他深入未知的水域。当时，他和其他海员找到了一大片正在泄露的黑色液体，并且没人知道是什么。尽管他们的工作就是调查他们所找到的新事物，但是船上除了诺提勒斯之外，没人敢于面对这片黑水。在他穿上笨重的潜水服，翻越护栏之后，仅仅过了一会儿，就有一些潜伏在黑水中的东西将他给牢牢抓住。他紧紧握住船的一侧，但底下的东西狂野地拉扯着他，让整条船只都摇晃不已。其他的海员心生惧意，并做了一个可怕的决定。",
      "shortname": "Nautilus",
      "name": "深海泰坦",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 75,
      "bio": "宏伟屏障的南部是一片被诅咒的凶险之地，因此人烟稀少，而英雄更是凤毛麟角。那里的大部分地区仍然残留着上次符文战争留下的创伤，特别是神秘的库莽古森林。在这些陌生的土地上蕴藏着被人久已遗忘的宝藏，许多人不惜冒生命危险去寻宝。奈德丽当时只是一个小姑娘，随着寻宝的父母一起迷失在这片茂密的雨林中。丛林是无情的，她眼睁睁地看着自己的父母染上莫名的恶疾在痛苦与煎熬中死去。就是在这样恶劣的环境中，奈德丽奇迹般地生存了下来。由于她天真无邪，童稚可人，丛林中的野兽都很喜欢她。",
      "shortname": "Nidalee",
      "name": "狂野女猎手",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 76,
      "bio": "在魔腾出现之前，人们都认为日有所思才会夜有所梦，梦只是他们在睡觉时昙花一现的无意义影像。但当联盟召唤师受到一连串和梦相关事件的影响后，人们开始怀疑这个说法。有些人尖叫从梦中惊醒，终日惶惶不安；有些人无法入睡，黑夜的到来让他们渐渐失去心智；有些人甚至再也没有醒来。医生们也很困惑，不知道事出何由。直到有一天，一名建筑师昏倒在扭曲丛林旁的枢纽，目击者说建筑师临死前大声呼喊过。紧接着，魔法能量从枢纽中涌出，魔腾腾空而出。魔腾带着杀气袭来，在召唤师用魔法将他限制前，他屠杀了所看到的一切。",
      "shortname": "Nocturne",
      "name": "永恒梦魇",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 77,
      "bio": "有时，友谊的羁绊甚至要比血缘的羁绊更强。当一个无畏的男孩和一个可怕的雪人通过友谊连接到一起时，这个羁绊就会变成一股不容小觑的力量。在被赋予驯化这头可怕怪兽的责任时，其他人会用锁链，而努努用的是友谊。现在，努努和他壮硕的朋友威朗普已经成了一对形影不离的拍档。通过雪人的神秘力量，这对拍档将青春活力与野蛮力量结合在一起，共同克服那些对于任何双人组合来说无法逾越的障碍。努努对于他的双亲，以及加入隐居的冰霜守卫部族之前的时光，仅有一些模糊的记忆。努努在监护人中从来都不受欢迎。",
      "shortname": "Nunu",
      "name": "雪人骑士",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 78,
      "bio": "大多数人会说，死亡是一件可怕的事情；这些人中肯定没有奥拉夫。这个狂战士只为战争的怒吼和钢铁的交鸣而活。对荣誉的渴求和无名之死的虚无诅咒驱使着奥拉夫，让他一往无前地投入每一场战斗。奥拉夫听从他血脉深处的嗜血欲望的摆布，并且他只有在鬼门关外拼杀时才真正活着。洛克法是一块沿海半岛，位于弗雷尔卓德最为荒蛮的地区当中。在那里，怒火是唯一一种能让冻僵的骨头变暖的火焰，血液是唯一一种能够自由流动的液体，并且没有什么事情，能比变老、变弱和被遗忘更加糟糕的了。",
      "shortname": "Olaf",
      "name": "狂战士",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 79,
      "bio": "来自皮尔特沃夫的科林丶瑞菲克有一个女儿，名字叫奥莉安娜。奥莉安娜是他的掌上明珠，对他而言极其重要。虽然奥莉安娜很有跳舞天赋，但她却对英雄联盟的英雄极其着迷，所以她辛苦训练，希望有朝一日也能成为其中一员。不幸的是，奥利安娜从未经历风雨，她的纯真无邪带来了很多危险甚至失去了性命。宝贝女儿的死让科林心痛欲绝，他陷入了极度绝望，并从此沉迷于研究高科技。科林无法忍受女儿的死所带来的空虚，因此他决定制造一个替代品——一个可以实现奥莉安娜加入联盟愿望的替代品。",
      "shortname": "Orianna",
      "name": "发条魔灵",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 80,
      "bio": "“但求一真命英雄，抑或尔等泛泛之辈百人余，方可与我一战，永为世人传颂。”举世无双的勇士潘森是一名势如破竹、势不可挡的战斗精英。他生于巨神峰脚下的尚武民族拉阔尔，后来他成功攀登上了巨神峰的陡峭绝壁，证明了自己的资格，并成为了神选之人，变成了战争星灵的肉体化身。他被赋予超越人类的力量，无情地寻找巨神峰的敌人，所到之处尸横遍野。",
      "shortname": "Pantheon",
      "name": "战争之王",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 81,
      "bio": "“我不是英雄。只是个拿锤子的约德尔人。”符文之地不乏英勇之人，但很少有人能和波比一样坚毅。带着长度两倍于她身高的锤子，这个决绝的约德尔人已经花费了数不清的岁月来寻找那个“德玛西亚英雄”。然而，这位据称是她武器的合法持有人的英雄，只是个虚构出来的人物。",
      "shortname": "Poppy",
      "name": "圣锤之毅",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 82,
      "bio": "奎因和华洛是一对精锐的游侠搭档。凭借着弩弓和利爪，他们深入敌军领土执行着祖国最为险峻的任务，小至快速侦查，大至致命刺杀。这对搭档那牢不可破的羁绊在战场中非常致命，敌方在被摧残并身中百箭之后，才会意识到与他们进行战斗的不只一人，而是两位德玛西亚的传奇。奎因在还是小女孩的时候，就和她的孪生兄弟一样渴望着冒险。他们梦想着成为骑士，但在德玛西亚的边陲之地，有的只是安静平凡的小日子。他们还幻想着在遥远的地方百战百胜，为他们的国王赢取荣誉，并以德玛西亚的正义之名斩杀敌人。",
      "shortname": "Quinn",
      "name": "德玛西亚之翼",
      "type2": "2",
	  "type": "15"
	 },{
		 id: 83,
      "bio": "“好吧。”被很多人崇拜，被部分人讨厌，但是没人知道他的底细，拉莫斯这个令人好奇的存在，一直是一个谜。无论这个身披尖刺的家伙去哪里，人们总有各种关于他起源的理论，从他是半神或是神圣的先知，到被魔法转变的野兽，各种理论一直悬而未决。无论真相如何，拉莫斯总是在沙漠中穿行无忌，不为任何事物停留。",
      "shortname": "Rammus",
      "name": "披甲龙龟",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 84,
      "bio": "雷克塞是她族群之中体型最大、脾气最暴的。她是一个无情的掠食者，可以在地底挖掘隧道，来伏击并吞噬她的猎物。她那永不满足的饥渴已经使鼎盛一时的恕瑞玛帝国遍布废墟。商人、贸易者和武装商队都会绕行百里，来躲开这些广袤的地区，但是狡诈的盗匪们会引诱粗心的人们进入雷克塞的杀戮之地。一旦雷克塞侦测到你，你的命运就已注定。毫无逃生的希望；她是来自沙砾之下的死亡。",
      "shortname": "RekSai",
      "name": "虚空遁地兽",
      "type2": "2",
	  "type": "1"
	 },{
		 id: 85,
      "bio": "“鲜血和复仇。”雷克顿是一个令人恐惧，充满愤怒的飞升者，他来自恕瑞玛那灼热的沙漠之中，曾经是帝国的最忠实的勇士，带领着恕瑞玛的军队战无不胜。然而，帝国陨落后，雷克顿被埋葬在黄沙之下。时过境迁，他也慢慢的变得疯狂。现在，他已经重获自由，心智却完全被找寻并杀死自己的兄长内瑟斯的愿望所吞噬，因为这份疯狂让他认为，内瑟斯才是他数百年黑暗囚禁的始作俑者。",
      "shortname": "Renekton",
      "name": "荒漠屠夫",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 86,
      "bio": "在藏品猎人雷恩加尔的兽穴里，每一面墙上都陈列着来自瓦洛兰里最为致命的生物们的头颅、巨角、利爪与尖牙。尽管他的收藏非常广泛，但他仍然没有满足，并且不知疲倦地寻找着更加强大的猎物。他的每次猎杀都颇费时间，包括研究他的猎物，学习，以及为了与那个他绝对无法打败的怪兽的下次相遇做准备。雷恩加尔从来不知道他的亲生父母是谁，一个被尊为传奇猎人的人类将他抚养长大。他是一个完美的学生，专心地汲取着他养父的课程，并用他怪异的野性本能来改进它们。",
      "shortname": "Rengar",
      "name": "傲之追猎者",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 87,
      "bio": "“战争与谋杀之间，潜藏着我们的心魇。”在诺克萨斯，每一位居民都可以平步青云，而无论其种族、男女、贵贱——实力，就是一切。锐雯曾怀着对此理想的坚定信仰，不懈地追求着远大的前程。她曾是一位初露锋芒的士兵，那时的她能够挥动一把与自己差不多重的长剑。她曾是一位无情高效的勇士，但是她真正的实力潜藏在她的信念之中。她总是毫不迟疑地投入战斗：不因道德而犹豫，不因死亡而恐惧。锐雯逐渐成为了同辈之中的领头人物，诺克萨斯精神的一个典型代表。",
      "shortname": "Riven",
      "name": "放逐之刃",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 88,
      "bio": "“呃，能不能别把你的脸贴在我的装备上!”虽然出生在身材矮小的约德尔家族，但兰博矮小的身材却无比刺眼，因此在成长过程中他经常被欺负。为了生存，他必须比同龄人更好斗，更机智。这也产生了他锱铢必较的坏脾气，不管谁得罪了他，他都有仇必报。久而久之，他变得孤独，没有朋友，但他丝毫不介意。他喜欢修理东西，喜欢和各类小工具呆在一起。他经常在废品堆里翻找东西，这时的兰博已展现出机械师的天赋。他的老师推荐他到位于皮特沃夫的约德尔科学与进步学院进修，或许在那里他能成为黑默丁格的得意门生。",
      "shortname": "Rumble",
      "name": "机械公敌",
      "type2": "2",
	  "type": "12"
	 },{
		 id: 89,
      "bio": "“小心照看这个世界。既是造物，便可摧毁。”瑞兹是符文之地广为人知的最老练的法师之一。他生于远古，饱经风霜，肩负着不可承受之重任。这位大法师的武器，是他无可摧折的决心和丰富的秘法学识，他一生都在寻找着世界符文——它们是令这世界从无到有、万物成形的原生魔法所留下的碎片。他一定要找到所有这些神秘的字符，以免落入恶人之手。虽然它们曾经被用来创造符文之地，但它们同样可以被用于毁灭。",
      "shortname": "Ryze",
      "name": "符文法师",
      "type2": "2",
	  "type": "12"
	 },{
		 id: 90,
      "bio": "瑟庄妮自小就习惯于苦难，崇尚于残暴。在其他人屈从于弗雷尔卓德的艰难险阻之时，她却视之为磨练，直到痛苦成为力量，饥饿成为鼓励，冰霜化身淘汰弱者的盟友。通过考验，她学会了要想在永冬之中成长，就必须变得冷酷无情。在瑟庄妮眼中，她的追随者们要么拥有忍耐的勇气，要么拥有赴死的权利。一旦她征服了弗雷尔卓德，她知道幸存者们便会建立一个让人畏惧国度。还是孩子的时候，这位凛冬之爪的领袖就目睹了部族的人民在缓慢减少。寒冷与饥饿带走了大部分人。",
      "shortname": "Sejuani",
      "name": "凛冬之怒",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 91,
      "bio": "常人都不会视死亡如儿戏。死确非儿戏，但如果你是萨科——则另当别论了。他是瓦洛兰第一位专业的嗜杀喜剧演员。他喜欢变着戏法将人折磨致死，然后放声大笑。他如何获得恶魔小丑的名号仍是个未解之迷。至于他来自何方也是众说纷纭，萨科对此也一直守口如瓶。大多数人认为萨科并非来自符文之地，而是从黑暗扭曲的世界召唤来的。另一些人则认为，他是人类阴暗欲望衍生出的恶魔化身，因此不能以常理而论。而最为可信的一种说法则是萨科是一名雇佣杀手，不需要服务时便捣腾他那些可笑的玩意。",
      "shortname": "Shaco",
      "name": "恶魔小丑",
      "type2": "2",
	  "type": "3"
	 },{
		 id: 92,
      "bio": "“无惧，无恨，无情。眼持中道，无可动摇。”身为神秘的武装教派领袖，慎背负着暮光之眼的称号，力图将平衡的理念贯彻于世。为了超脱自身的情感、偏执以及自我，他一直艰难地挣扎着。慎手握魂刃，行走于无人通晓的隐秘道路，追求着无偏无倚的冷静裁决。",
      "shortname": "Shen",
      "name": "暮光之眼",
      "type2": "2",
	  "type": "4"
	 },{
		 id: 93,
      "bio": "在符文之地，有少数龙类，能熟练地运用他们的独特骨骼里所流淌的强烈魔法能量，因而进化成了一种罕见的天空之龙。这些强大且神秘的生物，绝大部分时候都隐藏在远离人类国家的地方。不过，有一些会被人类文明所吸引，并变成人类的形态，将自己融入到人类世界中去。偶尔会有个别龙被某个人类的心灵所吸引，并与之发生关系。虽然几率微乎其微，这种结合有时也会结出果实，而它们的后代会成为少数光临符文之地的半龙人之一。希瓦娜就是这样一种生物，一名普通的德玛西亚农家女和天空之龙的爱情结晶。",
      "shortname": "Shyvana",
      "name": "龙血武姬",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 94,
      "bio": "辛吉德是祖安备受尊敬的炼金世家的后裔。即使在年轻之时，他调制药剂的天赋便远在同龄人之上，很快他便在化学同道中鹤立鸡群。因此他被臭名昭著的沃里克收为徒弟也就不足为奇了。沃里克当时是诺克萨斯和艾欧尼亚对战时的军队雇佣药剂师。在沃里克的实验室里，辛吉德无休无止地劳作着，迅速地领悟着他师傅致命技艺的每一个细节。他毫不担心他的劳作会带来死亡与毁坏的恶果。当变狼幻想症的诅咒降临到他师傅的头上时，辛吉德已经准备就绪，迫不及待地要从一名苦工转变成发明家",
      "shortname": "Singed",
      "name": "炼金术士",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 95,
      "bio": "血。闻到它了。想要。疼痛。需要！靠近了。他们来了。没有锁链了？自由了！杀啊！接敌了。是的！死吧！死吧！死掉了。太快了。没有战斗的感觉。更多。我想要……更多。一个声音？不熟悉。我认识他。大将军。我的将军。他带头。我跟从。正在进军。去哪里？我应该知道。我记不起来。血都流到一起了。不要紧吗？诺克萨斯征服者们。其余的？无关紧要。太久了……从我上次品尝到胜利时算起。",
      "shortname": "Sion",
      "name": "亡灵战神",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 96,
      "bio": "“我才不管你的钱币上是谁的脸，只要它还能花出去就行。”希维尔是恕瑞玛沙漠里远近闻名的赏金猎人和雇佣兵团长，她的生意遍及整个恕瑞玛沙漠。她带着那把嵌着珠宝的传奇十字刃，为那些付得起高价的人进行战斗，并赢得了数不尽的胜利。凭借着永不退缩的勇气和永无止境的野心，她以深入恕瑞玛的古墓中盗宝为荣，当然也是为了巨额的回报。现在，随着远古力量在恕瑞玛的每一颗砂砾下复苏，希维尔发现自己在宿命的冲突中进退两难。",
      "shortname": "Sivir",
      "name": "战争女神",
      "type2": "2",
	  "type": "5"
	 },{
		 id: 97,
      "bio": "“我们生来一体。我们永不分离。”斯卡纳是一只身形庞大的水晶蝎，来自于恕瑞玛的一处隐秘的山谷。作为古老的壳人族（Brackern），斯卡纳和他的同胞因卓然的智慧以及与大地深切的联系而名声在外。他们的灵魂都得到过生命水晶的加持，所以祖先的记忆与现世的思绪都被完好地保存了下来。在久远的过去，壳人族为了躲避神秘的魔法灾难而进入了长眠，然而现在，新的威胁唤醒了斯卡纳。作为整个部族中唯一醒来的人，他将拼尽全力保护其余的同胞，免遭任何人的迫害。",
      "shortname": "Skarner",
      "name": "水晶先锋",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 98,
      "bio": "当娑娜尚在襁褓之时，她便被抛弃在艾欧尼亚的一家孤儿院的门前。因而她对自己的亲生父母毫无记忆。人们在一个来历不明的精巧琴匣中，发现还是婴儿的娑娜安静地躺在一把古琴之上。从小她就是一个特别乖巧的孩子，总是默不作声，怡然自得。照顾她的护工们原本确信她一定很快就会被领养，但不久之后大家伙儿恍然大悟——原来娑娜天生失声。在长大成人之前，娑娜一直住在孤儿院中，在绝望的沉默中看着领养者们络绎不绝地从她身边经过。",
      "shortname": "Sona",
      "name": "琴瑟仙女",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 99,
      "bio": "索拉卡，艾欧尼亚的众星之子，是同族的第一人。当人们蜂涌着去开发瓦洛兰丰富的魔法能量时，她却首开先河来探索宇宙自身的魔法能量——宇宙仿佛一个自成体系的天体汪洋，符文之地就遨游于其他相似天体之中。虽然符文之地的魔法师大多局限于符文的有限力量（尽管这些力量异常巨大）中，但总有一些人会另辟蹊径，探索魔法的更深处。索拉卡的探索超越了符文之地的天空，令她能召唤宇宙星辰的力量，而她的进化也远在她的族人之上。这股力量令她发生了不可思议的改变——她也因此以“众星之子”闻名于世。",
      "shortname": "Soraka",
      "name": "众星之子",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 100,
      "bio": "有关斯维因的最早记载出现在诺克萨斯养老院一名医生的笔记上。据载，斯维因一瘸一拐地走进病房，没有叫喊也没有抱怨，他的右腿被折成两段，骨头破皮而出。他的肩膀上站着一只阴森的小鸟，仿佛是黏在他肩上似的。当医生询问他的健康状况和年龄时，年轻的斯维因很冷静地回答，甚至直勾勾地盯着医生，这让医生有些畏惧了。尽管斯维因胫骨处不断传来爆裂的回响，但斯维因的目光从不模糊，甚至胫骨爆开产生的剧痛也不能改变他坚毅的眼神。",
      "shortname": "Swain",
      "name": "策士统领",
      "type2": "2",
	  "type": "12"
	 },{
		 id: 101,
      "bio": "辛德拉生来就具有无边的魔法潜能，除了爱好以自己的意志来运用这难以置信的能量外，就再无所好。随着每一天的过去，她的魔力天赋也变得更加有效且更具毁灭性。辛德拉拒绝任何平衡或克制的观念，只想保持她的能量的控制权，即使它意味着那些想要制止她的当局会废掉她。在艾欧尼亚度过的年少时光里，辛德拉对魔法的鲁莽使用吓坏了村庄的长老们。他们将她带到一个偏僻的寺庙，把她交给一个老法师照顾。令辛德拉愉快的是，老法师解释说，这个寺庙是一间学校——老法师可以在这里指引她，让她发展她的才能。",
      "shortname": "Syndra",
      "name": "暗黑元首",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 102,
      "bio": "“世界，就是一条河流，而我，是它的国王。”塔姆丶肯奇在符文大陆的各个水道游历着，用毫无戒心者们的悲惨喂养着他那贪得无厌的食欲。这个充满奇异魅力的美食家纵情享受着猎物们受苦时的每个时刻。一次伴随着两件外套*的交易也许会带你通往任何想去的地方，但你的旅程几乎必然会在绝望的深渊中结束。（注：“两件外套”是一首福音曲，歌词大意是关于一新一旧两件外套的选择，其中的新外套是由救世主赐予的，然而塔姆并不像救世主那样仁慈。）",
      "shortname": "TahmKench",
      "name": "河流之王",
      "type2": "2",
	  "type": "46"
	 },{
		 id: 103,
      "bio": "塔莉垭来自恕瑞玛，怀有操纵岩石的能力。身为一名四处漂泊的法师，她洋溢着饱满的热情，天真而又坚定。她在年幼的憧憬与成人的责任之间苦苦求索，踏遍了瓦洛兰的山山水水，只为寻得控制己身异能的法门。据传说，已驾崩无数纪元的皇帝现已重生，她毅然决定返回故乡，保护自己的族人免遭恕瑞玛的沙暴吞没。有些人把她的温柔善意当做是懦弱的表现，最终也为自己的愚鲁付出了代价。塔莉垭青春稚嫩的举止背后，是一颗敢于移山填海的雄心，和一个堪能倾世的灵魂。",
      "shortname": "Taliyah",
      "name": "岩雀",
      "type2": "2",
	  "type": ""
	 },{
		 id: 104,
      "bio": "“瓦洛兰的三个最能取人性命的刃武大师，都与杜 · 克卡奥家族有关系：我的父亲，我，还有泰隆。来挑战我们吧，如果你够胆的话。”——卡特琳娜 · 杜 · 克卡奥泰隆最早记住的东西，就是诺克萨斯地下隧道的阴暗，以及手中刀刃那令人放心的可靠感。他对家庭，温暖，或是友善没有一点印象。所窃金币的叮当作响，以及身后墙壁的安全感，反而是他曾渴望的一切。泰隆仅凭他的急智与巧手谋生，在诺克萨斯破旧的下层社会勉强度日。",
      "shortname": "Talon",
      "name": "刀锋之影",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 105,
      "bio": "“最强的武器必然最美。”塔里克是守卫者星灵，用超乎寻常的力量守护着符文之地的生命、仁爱以及万物之美。塔里克由于渎职而被放逐，离开了祖国德玛西亚，前去攀登巨神峰寻找救赎，但他找到的却是来自星界的更高层的召唤。现在的塔里克与古代巨神族的神力相融合，以瓦洛兰之盾的身份，永不疲倦地警惕着阴险狡诈的虚空腐化之力。",
      "shortname": "Taric",
      "name": "瓦洛兰之盾",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 106,
      "bio": "在班德尔城，提莫是流传于兄弟姐妹中的一则传奇。就约德尔人而言，提莫有点与众不同。虽然他喜欢与其他约德尔人结伴，但他也常常坚持要单枪匹马地执行保卫班德尔城的任务。他为人真诚，性情温和，然而一旦进入战斗，提莫就像变了个人似的，在巡逻时会果断了结那些敌人的性命。在他还是一名年轻的新兵之时，军事训练的教官与其他学员就发现——虽然提莫平常和蔼可亲，很有魅力，然而一旦搏斗练习开始，他就变得异常严肃，效率极高。提莫的上司很快便引导他朝着“主舰斥候队”的方向发展。",
      "shortname": "Teemo",
      "name": "迅捷斥候",
      "type2": "2",
	  "type": "35"
	 },{
		 id: 107,
      "bio": "“人心是肉长的……玩具。”锤石是一个残酷成性的幽灵收割者，以折磨生灵和死灵为乐。他曾是一个蹂躏囚犯的无情狱卒，后来被受他折磨的囚犯们吊死在他自己的锁链上。在他的恶毒本质解开束缚后，魂锁典狱长游荡在符文大陆，寻找着猎物。他取乐的方式，是先把那些最为不羁的猎物们的意志给破坏掉，然后将他们的灵魂捕获到他的那盏泛着幽绿光芒的灯笼中。",
      "shortname": "Thresh",
      "name": "魂锁典狱长",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 108,
      "bio": "伟大是不分体形和个头的，正如这位小个子、手持重炮的约德尔人所证明的那样。在一个充满了动荡的世界里，崔丝塔娜拒绝从任何挑战中退缩。她代表着军事专精、坚定勇气和无限乐观的顶峰。对崔丝塔娜和她的加农炮“轰隆号（Boomer）”来说，每个任务都是一次机会，用来证明英雄确实存在。",
      "shortname": "Tristana",
      "name": "麦林炮手",
      "type2": "2",
	  "type": "35"
	 },{
		 id: 109,
      "bio": "特朗德尔是一个粗鄙且狡猾的巨魔，性格非常顽劣。没有什么东西，是他不能打到认输并屈服于他的意志的，甚至就连寒冰本身也是。带着他的巨大、冰冷的棒子，他让敌人从心底感到寒冷，并且用锯齿状的冰碎片刺穿他们。在强烈的领土欲的支配下，他会追杀任何蠢到进入他领地的人，并在他们血溅冰原时嘲笑他们。特朗德尔的兵团曾经跟随过一个愚蠢、懦弱的酋长。在如此弱的领袖手下，特朗德尔担心他和他的族人沦为分布在冰原上的其他巨魔部族的猎物。",
      "shortname": "Trundle",
      "name": "巨魔之王",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 110,
      "bio": "拜他的桀骜不羁和怒气所赐，泰达米尔在冰原上披荆斩棘，与弗雷尔卓德上杰出的战士较量以精通战斗的艺术。这个暴怒的野蛮人想向那个摧毁他部族的人复仇以及击败所有阻挡他和他进行最后复仇的人们。为了生存他与苦难争斗，不惜在弗雷尔卓德被冻伤，年轻的泰达米尔和他的子民为了这片土地稀有的资源与其他部族交战。一场这样的战斗永远的改变了他的生活。掠夺者们在死寂的夜晚埋伏了泰达米尔的部族，尽管他的战士们将第一波攻势阻挡了回去，他们却没有准备好面对下一个接近的黑影。",
      "shortname": "Tryndamere",
      "name": "蛮族之王",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 111,
      "bio": "崔斯特是一名声名狼藉的纸牌老千和诈骗惯犯，世界上任何有人烟的地方都有他施展魅力和赌艺的足迹，让那些富人和痴人既羡慕又嫉恨。他很少会认真起来干一件事，总是用一抹轻蔑的微笑和一副漫不经心的随性面对每一天。无论做任何事情，崔斯特永远都会在袖子里藏一张王牌。",
      "shortname": "TwistedFate",
      "name": "卡牌大师",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 112,
      "bio": "祖安是一座科技、魔法、重商主义混杂的扭曲之城。年轻的次世代技术科学大大地促进了文明的发展，而它在祖安的研究与应用也日益扩展了道德的边界。不计其数的工厂与实验室不断地向环境排泄废弃物，令祖安变成了一个乌烟瘴气之地。与祖安的天空相比，它的地下污染则更为严重。所有祖安的废弃物都汇聚在它的下水道里，混合成一种剧毒而神秘的调合物。从这种可怕混合物里诞生了一只瘟疫鼠——图奇。不同于他的尚未进化的表亲，图奇具有与人无异的知觉……如果他们与他一般疯狂的话。",
      "shortname": "Twitch",
      "name": "瘟疫之源",
      "type2": "2",
	  "type": "53"
	 },{
		 id: 113,
      "bio": "乌迪尔不只是一个人而已；他体内承载着四个原始兽灵的不羁能量。在与这些兽灵的野性进行心灵感应时，乌迪尔可以驾驭它们独特的力量：猛虎为他提供速度和凶猛，灵龟为他提供韧劲，巨熊为他提供蛮力，而凤凰为他提供它的永燃烈焰。结合它们的能量，乌迪尔就能击退那些妄图危害自然秩序的人。在弗雷尔卓德里，有一支独特的族群在那些蛮荒之地的文明之外生活着。他们是自然界的监护人：兽灵行者。据说，一旦有小孩诞生于血红之月下，那么这个小孩就会生活在灵体世界和人类世界之间。",
      "shortname": "Udyr",
      "name": "兽灵行者",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 114,
      "bio": "联盟里有很多战士因其神力、精明或精湛的技能而成为大人物。其他战士却只想保住小命。曾是诺克萨斯一名伟大士兵的厄加特，可能就属于后者。厄加特喜欢潜伏到敌人的主战部队里，然后在敌人的军队中制造混乱，他经常在此过程中受重伤。当厄加特的身体已无法再承受更多伤害时，残废的他被委派为诺克萨斯高级刽子手。这时候的他，双手残废，举步为艰。镰刀型的假肢让他得以从事这份血腥的工作。本应是厄加特最光荣的时刻，最终却让他走到了尽头。因为厄加特有军队背景，所以他经常随同派遣队到其他地方执行判决。",
      "shortname": "Urgot",
      "name": "首领之傲",
      "type2": "2",
	  "type": "51"
	 },{
		 id: 115,
      "bio": "“一支箭矢的生命一闪即息，支撑它的唯有方向与目的。”由于他举世无双的弓术和无可置疑的荣誉感，韦鲁斯被一间神圣的艾欧尼亚寺院选作守望者。这个寺院是为了镇压一个远古的腐败深渊而建。这个深渊是那么地令人不安，以至于艾欧尼亚的长老们害怕它将整个岛屿都笼罩在黑暗之中。韦鲁斯对他的职位相当自豪，因为只有最杰出的艾欧尼亚战士才有被这个角色选取的资格。他和他的家人一起住在附近的村庄里，并且在清规戒律的约束下过着宁静的生活，直到有一天，诺克萨斯的铁蹄入侵了艾欧尼亚。",
      "shortname": "Varus",
      "name": "惩戒之箭",
      "type2": "2",
	  "type": "25"
	 },{
		 id: 116,
      "bio": "这个世界并没有人们想象中那么文明，还是有一些人愿意追随横行符文之地的暗黑魔法，并因此堕落腐败,肖娜·薇恩对此了如指掌。作为德玛西亚精英家族的掌上明珠，薇恩的父亲一直让她相信她处于警卫队的保卫下。年轻单纯的薇恩确信她所在的世界非常安全。直到那一夜，一个变态女巫盯上了她的父亲。这个恶毒的女人成功绕过他父亲的侍卫，先是折磨她们一家子，最后把她们全部杀死。薇恩躲了起来，趁着老巫婆一离开就逃跑。在她跑的时候，耳边一直萦绕着亲人们的尖叫声。从那天起，她心中燃起了永远不能泯灭的怨恨之火。",
      "shortname": "Vayne",
      "name": "暗夜猎手",
      "type2": "2",
	  "type": "35"
	 },{
		 id: 117,
      "bio": "大多数人不会将约德尔人与令人惧怕的形象联想在一起。约德尔这个平易近人的迷你民族，虽说勇猛，但通常人们或多或少会认为他们是快乐的种族。他们那高八度的声音，以及天生的可爱外形，会激发出体型较大的民族内心深处的某种保护本能，或者至少会让他们的脑海中浮现出小孩扮大人的画面。然而，约德尔人时不时地会变得很邪恶，即使个子不高，也能让其他人心底生出不寒而栗的感觉。维迦便是这样一位扭曲的约德尔人。作为黑魔法师，以及宇宙能量的腐蚀者，他是瓦洛兰最强大的法师之一。",
      "shortname": "Veigar",
      "name": "邪恶小法师",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 118,
      "bio": "我进入了突如其来的强光。闪烁。闪烁，闪烁，闪烁。我调整好眼睛，评估我前方的景观。东西在乱窜。我往下看，发现了一只小个的白色生物，用后腿站立着，嗅闻着我的躯体。它吸引了我的注意。你有什么用途？我分析这个生物。品红色热能光束一闪而过，它曾颤动的地方扬起尘埃。哺乳动物……夜行习性……无可挑剔的听觉。难以置信的弱小。但它们的繁殖能力如此强大。“唔，”我喃喃自语。希望能发现更加复杂的物体；那些东西把我给迷住了。",
      "shortname": "Velkoz",
      "name": "虚空之眼",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 119,
      "bio": "对于蔚来说，所有问题都只是一道墙壁，一道可以用她的巨型海克斯科技拳套一拳打穿的墙壁而已。尽管她的成长过程总是伴随着违法乱纪，但现在，蔚将她的犯罪本领用来为皮尔特沃夫警方服务。蔚的傲慢态度、粗俗幽默和公然抗命，经常会激怒她那循规蹈矩的搭档，凯特琳。但即使是皮城女警也无法否认，在与犯罪团伙的斗争中，蔚是一个无价之宝。蔚的童年时代在皮尔特沃夫的一个不受法律约束的郊区度过。为了生存下去，她学会了抢劫和诈骗。通过偷窃并拆散海克斯科技硬件，她掌握了熟练的机械技术。",
      "shortname": "Vi",
      "name": "皮城执法官",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 120,
      "bio": "在年轻时，维克托就发现了他对科学与发明的激情，特别是机械自动化这一领域。他参加了祖安享有盛名的科技魔法大学，并带领了一支队伍，研发出了布里兹这一科学史上的突破，并期待着这项发明能够让他登上职业生涯的巅峰。不幸的是，他的傲人成果被斯坦里克教授给篡夺了。斯坦里克还窃取了研发布里兹知觉系统的声誉，并且后来还用维克托的研究成果来复活厄加特。于是维克托上诉，要求公正，却被置之不理，他也因此陷入深深的消沉之中。他离开了学院，并将自己关在他的私人实验室里，切断了与其他人的所有联系。",
      "shortname": "Viktor",
      "name": "机械先驱",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 121,
      "bio": "在诺克萨斯和暴风平原间的群山中有座寺庙，寺庙里藏着许多骇人听闻的巫术秘密。寺庙附近尸横遍野，这些尸体都属于那些误闯寺庙而被吸干血的人。无血干尸勾起了年轻的弗拉基米尔的好奇心。从诺克萨斯逃跑期间，他艰苦跋涉，穿过一座又一座的大山。一天前，十几岁的弗拉基米尔残暴地杀死了两个和他年纪相仿的男孩，纯粹因为他很享受观看鲜血喷涌而出的快感。弗拉基米尔很快就意识到自己杀戮的欲望再也无法抑制，如果继续留在诺克萨斯，他早晚会因此而受到处罚，因此，他毫不犹豫地离开了城邦，前往南方。",
      "shortname": "Vladimir",
      "name": "猩红收割者",
      "type2": "2",
	  "type": "24"
	 },{
		 id: 122,
      "bio": "弗雷卓德的无情北壁是熊人族的家园，这个凶猛好战的种族在这块冻土之上已经经历了上千年的洗礼。他们的首领是一位暴怒的敌手，他可以召唤闪电的力量击打敌人，以使其畏惧：他就是沃利贝尔，他既是个战士也是个谜团，致力于守护上古传统和部族里的战士精神。为了寻求智慧，沃利贝尔涉险攀登熊人族的神圣之峰，那是一座永远笼罩着闪电漩涡的山峰。传说风暴之眼将揭示预言，暴风雨则会标记部族中下一位伟大的领袖。在沃利贝尔登上山顶后，他被一道不寻常的闪电击中。",
      "shortname": "Volibear",
      "name": "雷霆咆哮",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 123,
      "bio": "沃里克可以算是故乡祖安最为强大、最受尊敬的人之一。在他臭名昭著的炼金师生涯里，沃里克以其非凡的技艺赢得了许多荣誉，其中有不少是在诺克萨斯攻打艾欧尼亚时，他为诺军服务获得的回报。隐居于远离前线的实验室内，沃里克和他的徒弟辛吉德不休不止地工作着，为诺克萨斯军队制造各种可怕的调配物。他的技艺如此强大，就算是艾欧尼亚最伟大的治愈师们——在众星之子索拉卡的领导下——也要挣扎着与他那卑劣灵魂制造出的毒药及化学武器做斗争。",
      "shortname": "Warwick",
      "name": "嗜血猎手",
      "type2": "2",
	  "type": "14"
	 },{
		 id: 124,
      "bio": "“一生为奴，许我永世为主。”泽拉斯是古代恕瑞玛的巫师 ，飞升以后的他变成了一种奥术能量体，在魔法石棺的碎片之中涌动。数千年来，他被囚禁在沙漠之下，但最近恕瑞玛的崛起却将他从远古的牢笼中解放出来。对权力的疯狂渴求驱使着他，想要夺回他认为属于自己的东西，并取代世界上这些自命不凡的文明，让自己成为唯一受膜拜的偶像，统一整个世界。",
      "shortname": "Xerath",
      "name": "远古巫灵",
      "type2": "2",
	  "type": "23"
	 },{
		 id: 125,
      "bio": "“人之死，难免也。可免者，唯败也。”每当德玛西亚国王嘉文三世在皇宫顶部那熠熠生辉的大理石阳台上发表激情澎湃的演讲时，赵信都会侍立于他的身旁。人称“德邦总管”的赵信是光盾王朝的私人管家。他那高深莫测且不苟言谈的守夜值勤，使得关于他的“隐秘生活”与出身来源的推测层出不穷。不管是被茶余饭后的闲谈疑为“祖安的双重间谍”，还是被《德玛西亚恒量》的社论推测为“负债累累的符文法师”，赵信从未泄露出任何蛛丝马迹，以满足大众的好奇心……这当然是有充分理由的。",
      "shortname": "XinZhao",
      "name": "德邦总管",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 126,
      "bio": "亚索是一个百折不屈的男人，还是一名身手敏捷的剑客，能够运用风的力量来斩杀敌人。这位曾经春风得意的战士因为诬告而身败名裂，并且被迫卷入了一场令人绝望的生存之战。即使整个世界都已与他为敌，他也要竭尽所能地去将罪恶绳之以法，并恢复自身的名誉。亚索曾是艾欧尼亚某所知名剑术道场的天才学徒，并且还是同辈中唯一能够掌握传说中的御风剑术的学生。大部分人曾相信他注定会成为一位伟大的英雄。但是，因为诺克萨斯的入侵，他的命运被永久地改变了。",
      "shortname": "Yasuo",
      "name": "疾风剑豪",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 127,
      "bio": "“群岛……恸哭。约里克所在的教团早已被世人忘却，而他也成为了最后的幸存者。说不上是诅咒抑或是祝福，他拥有操控死者的能力。与他一同被困在暗影岛上的，只有逐渐腐败的尸体，还有他引到自己身边终日尖啸的死灵。约里克怪异的举止下掩藏着的却是他决绝的憧憬：在破败之咒的阴影下解放他的家园。",
      "shortname": "Yorick",
      "name": "牧魂人",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 128,
      "bio": "扎克是祖安某个实验的产物。这个实验是为了制造海克斯生化超级士兵——祖安无定型战斗体。他结合了残暴的力量和无限的灵巧，是一名全能的主宰者：这个创造性的战士可以弹过障碍并猛击他的敌人直至屈服。尽管扎克出生于武器实验室，却被一对有爱的父母救下并收养，并且成了一个和蔼友善的小孩。随着岁月的流逝，他逐渐成长为一名勇猛的英雄，宣誓保护祖安的普通老百姓们。很久以前，两名祖安的科学家发明了一种有机物，它可以在极端的条件下存活，自主地调整生理结构并产生巨大的力量。",
      "shortname": "Zac",
      "name": "生化魔人",
      "type2": "2",
	  "type": "16"
	 },{
		 id: 129,
      "bio": "劫是200年以来第一个冲破古老、禁忌之路的忍者。他违抗了他的宗族和导师，抛弃了束缚他一生的均衡与信条。劫现在为那些拥抱影之奥义的人提供力量，并屠杀那些墨守成规的人。劫是一个孤儿，他被一名伟大的忍者大师收养并训练。在他心目中，只有一个人能与他匹敌，他就是大师的儿子，慎。劫似乎永远都得不到导师的青睐，因为他与对手们的每一次较量都是以平局结束。在挫败感和嫉妒心的驱使之下，他开始寻找取胜之道。这个年轻的忍者冒险进入了宗族寺庙里的禁地，并找到了一个装饰华美的不祥之盒。",
      "shortname": "Zed",
      "name": "影流之主",
      "type2": "2",
	  "type": "13"
	 },{
		 id: 130,
      "bio": "吉格斯生来就有着捣鼓机械的天赋，但他自由散漫、过度亢奋的天性在约德尔科学家当中实属罕见。怀着成为黑默丁格那样的伟大发明家的雄心壮志，他很快凭借着狂躁的激情描绘出了一个个野心勃勃的工程蓝图，并且靠着他的那些充满争议的失败和前无古人的发现来为自己加油鼓劲。吉格斯的豪言壮语传到了皮尔特沃夫的那间闻名遐迩的约德尔学院。学院里备受尊敬的教授们共同邀请吉格斯前来展示他的技艺。吉格斯漠视安全的个性让这次演示很早就得出了结论，因为正当吉格斯演示他的成果时，所用的海克斯引擎却过热并爆炸了，还将学院的墙壁炸了个大洞。",
      "shortname": "Ziggs",
      "name": "爆破鬼才",
      "type2": "2",
	  "type": "2"
	 },{
		 id: 131,
      "bio": "在厄尔提斯坦的废墟之地，曾经有一座恢宏的城池，很久以前在一场可怕的符文战争中灰飞烟灭，就像宏伟屏障之下的大多数陆地一样。尽管如此，还是有一个人生还了下来：一名叫做基兰的魔法师。对于他这样一个时光痴迷者来说，住在城市的钟塔之中是再合适不过了。当毁灭的战火即将席卷至他的家乡之时，基兰用强大的瞬间魔法做了个实验来预测未来的种种可能性，希望能发现一个和平的解决之道。然而基兰的魔法影响了他对时间流逝的感知，当厄尔提斯坦遭到一群未知的召唤黑骑士组成的方阵袭击之时，基兰正处于冥想的静止之中。",
      "shortname": "Zilean",
      "name": "时光守护者",
      "type2": "2",
	  "type": "26"
	 },{
		 id: 132,
      "bio": "婕拉渴望掌控自己的命运。这株垂垂老矣的古老植物，为了获得第二次生命，将她的意识转移到一具人类的躯体上。数个世纪前，她和她的同类主宰着瘟疫之地，任何动物只要在它们的领地上踏足，就会被它们的荆棘和藤蔓所吞噬。随着岁月的流逝，动物们日渐消亡。食物逐渐变得稀缺起来，而婕拉只能无助地看着最后一个同类枯萎凋零。她本以为自己将孤独地死去，但是一个冒失女法师的出现，为她带来了一线生机。这几年以来，婕拉第一次感觉到有生物在离自己如此之近的地方徘徊。",
      "shortname": "Zyra",
      "name": "荆棘之兴",
      "type2": "2",
	  "type": "26"
	 }
  ];

  return {
    all: function() {
      return heros;
    },
    remove: function(hero) {
      heros.splice(heros.indexOf(heros), 1);
    },
    get: function(heroId) {
      for (var i = 0; i < heros.length; i++) {
        if (heros[i].id === parseInt(heroId)) {
          return heros[i];
        }
      }
      return null;
    }
  };
});